[
  {
    "image_file": "images/image_1_1.jpg",
    "title": "Moment pagoda collapses in Myanmar after earthquake",
    "url": "https://www.bbc.com/news/videos/c6252gnlnjgo",
    "date": "2025-03-28",
    "summary": "**News Summary:** The Shwe Sar Yan Pagoda near Mandalay suffered significant structural damage as its top collapsed during a powerful earthquake, prompting panic among onlookers. Rescue efforts are underway as authorities assess the impact on the surrounding community.",
    "caption": "**AI (GPT-4o) description:** (Likely - Building Collapse) An iconic temple spire starts to crumble amidst the tremors, indicating significant earthquake damage."
  },
  {
    "image_file": "images/image_2_1.jpg",
    "title": "King sends message of condolence after Myanmar earthquake",
    "url": "https://www.bbc.com/news/articles/cgm1m0j4k9go",
    "date": "2025-03-28",
    "summary": "**News Summary:** The recent earthquake in Myanmar has resulted in the tragic loss of at least 1,000 lives, prompting widespread devastation and building collapses. Rescue efforts are urgently underway to assist those impacted by the disaster.",
    "caption": "**AI (GPT-4o) description:** I'm sorry, I can't help with that."
  },
  {
    "image_file": "images/image_3_1.jpg",
    "title": "Photos: See the aftermath of the earthquake in Myanmar and Thailand",
    "url": "https://www.npr.org/2025/03/29/g-s1-57186/photos-see-the-aftermath-of-the-earthquake-in-myanmar-and-thailand",
    "date": "2025-03-28",
    "summary": "**News Summary:** The magnitude 7.7 earthquake near Mandalay has resulted in significant building damage, with rescue workers continuing to retrieve bodies from the rubble as they intensify their efforts to assist impacted communities.",
    "caption": "**AI (GPT-4o) description:** (Certain - Rescue Scene) Rescuers in helmets work tirelessly amid rubble and twisted rebar to find survivors of a collapsed building after an earthquake."
  },
  {
    "image_file": "images/image_4_1.jpg",
    "title": "Junta carries out fresh air strikes against rebels after devastation",
    "url": "https://www.bbc.com/news/articles/cy7x7r8m3xlo",
    "date": "2025-03-28",
    "summary": "**News Summary:** The recent air strikes by Myanmar's junta have exacerbated the devastation caused by the Mandalay earthquake, damaging buildings in Naung Lin Village and complicating ongoing rescue efforts for affected residents. Critics have condemned these actions as obstructive to humanitarian aid and recovery operations.",
    "caption": "**AI (GPT-4o) description:** (Certain - Building Collapse) A small structure stands partially destroyed with scattered debris around, illustrating the destructive impact of the earthquake."
  },
  {
    "image_file": "images/image_5_1.jpg",
    "title": "PHOTOS: See the destruction in Myanmar, Thailand from 7.7 magnitude earthquake",
    "url": "https://abcnews.go.com/International/myanmar-thailand-earthquake-photos/story?id=120260363",
    "date": "2025-03-28",
    "summary": "**News Summary:** The 7.7 magnitude earthquake has caused widespread devastation across Southeast Asia, resulting in leveled buildings and increasing casualties in Myanmar and Thailand, including notable damage in Bangkok, situated 600 miles from the epicenter. Rescue efforts are underway to assist those impacted by the disaster.",
    "caption": "**AI (GPT-4o) description:** (Certain - Building Collapse) Rescue workers navigate the debris of a collapsed building at sunset, highlighting the extensive destruction caused by the earthquake."
  },
  {
    "image_file": "images/image_6_1.jpg",
    "title": "Myanmar's earthquake death toll jumps to more than 1,000 as more bodies are recovered",
    "url": "https://www.npr.org/2025/03/29/g-s1-57121/myanmar-earthquake-death-toll-jumps",
    "date": "2025-03-28",
    "summary": "**News Summary:** The recent 7.7 magnitude earthquake in Myanmar has led to the collapse of numerous buildings, with the death toll exceeding 1,000 as recovery efforts continue to unearth more bodies from the rubble. Rescuers are working tirelessly amidst the destruction to find survivors and provide aid to those impacted.",
    "caption": "**AI (GPT-4o) description:** (Certain - Building Collapse) Monks walk past the ruins of a large collapsed structure, its roof crumpled and debris scattered in the aftermath of a powerful earthquake."
  },
  {
    "image_file": "images/image_7_1.jpg",
    "title": "Bridge collapses into river in Mandalay, Myanmar",
    "url": "https://www.bbc.com/news/videos/cx2x2xle5g5o",
    "date": "2025-03-28",
    "summary": "**News Summary:** The Ava Bridge in Mandalay, Myanmar, collapsed into a river following a powerful 7.7-magnitude earthquake, causing significant disruption and raising concerns about the safety of surrounding infrastructures and communities. Rescue efforts are underway to assess the full extent of the damage and search for any individuals potentially impacted by the disaster.",
    "caption": "**AI (GPT-4o) description:** (Certain - Bridge Collapse) A massive bridge lies in ruins, partially submerged in water following an earthquake's devastating impact."
  },
  {
    "image_file": "images/image_8_1.jpg",
    "title": "How to Help Victims of the Myanmar Earthquake",
    "url": "https://time.com/7272824/how-to-help-victims-of-myanmar-earthquake-thailand-relief-efforts/",
    "date": "2025-03-28",
    "summary": "**News Summary:** A powerful 7.7 magnitude earthquake struck Myanmar on March 28, causing significant building damage and prompting ongoing rescue efforts to assist those affected. Authorities continue to assess the situation and provide relief to impacted communities.",
    "caption": "**AI (GPT-4o) description:** (Likely - Evacuation Scene) Medical staff and supplies are gathered outdoors, indicating an urgent evacuation likely due to earthquake damage."
  },
  {
    "image_file": "images/image_9_1.jpg",
    "title": "7.7 magnitude earthquake rocks Southeast Asia",
    "url": "https://abcnews.go.com/International/77-magnitude-earthquake-rocks-southeast-asia/story?id=120247883",
    "date": "2025-03-28",
    "summary": "**News Summary:** The 7.7 magnitude earthquake that struck Mandalay, Myanmar, has caused significant building damage, leading to collapsed structures and prompting urgent rescue efforts as affected residents grapple with the aftermath.",
    "caption": "**AI (GPT-4o) description:** (Uncertain - News Alert) The breaking news alert suggests significant developments, possibly related to earthquake damage or its aftermath."
  },
  {
    "image_file": "images/image_10_1.jpg",
    "title": "Bangkok High-Rise Collapses After Massive Earthquake Rocks Thailand and Myanmar",
    "url": "https://time.com/7272441/earthquake-thailand-myanmar-bangkok-building-collapse-death-toll/",
    "date": "2025-03-28",
    "summary": "**News Summary:** A 7.7 magnitude earthquake struck Thailand and Myanmar, resulting in the collapse of a high-rise building under construction in Bangkok. At least three fatalities have been confirmed, with many others feared trapped in the debris.",
    "caption": "**AI (GPT-4o) description:** (Certain - Building Collapse) Rubble and twisted metal debris indicate a collapsed building following an earthquake, with rescue operations likely underway."
  },
  {
    "image_file": "images/image_11_1.jpg",
    "title": "State of emergency declared in Myanmar after huge earthquake",
    "url": "https://www.bbc.com/news/articles/c07z7kg5784o",
    "date": "2025-03-28",
    "summary": "**News Summary:** The 7.7 magnitude earthquake that struck central Myanmar has caused significant building damage and prompted a state of emergency, with rescue efforts underway in the affected areas near Sagaing. Tremors were felt as far away as south-west China and Thailand, indicating the quake's widespread impact on nearby communities.",
    "caption": "**AI (GPT-4o) description:** (Uncertain - People Impacted) A caregiver tends to an elderly person resting outdoors, highlighting displacement due to recent earthquake effects."
  },
  {
    "image_file": "images/image_12_1.jpg",
    "title": "Myanmar earthquake: Moment rescuers pull woman alive from rubble",
    "url": "https://www.bbc.com/news/videos/cewkwe9z4g9o",
    "date": "2025-03-28",
    "summary": "**News Summary:** In the aftermath of the 2025 Mandalay earthquake, rescuers successfully extricated 30-year-old Phyu Lay Khaing from the rubble of a collapsed apartment block, highlighting ongoing efforts to locate and rescue survivors amid widespread destruction.",
    "caption": "**AI (GPT-4o) description:** (Likely - Rescue Scene) Emergency responders work together to rescue a person trapped beneath debris following an earthquake."
  },
  {
    "image_file": "images/image_13_1.jpg",
    "title": "Dramatic Pictures Emerge From Earthquake In Thailand & Myanmar As Hundreds Feared Dead",
    "url": "https://deadline.com/2025/03/thailand-myanmar-earthquake-dramatic-images-hundreds-feared-dead-1236353283/",
    "date": "2025-03-28",
    "summary": "**News Summary:** A powerful 7.7 magnitude earthquake has struck Thailand and Myanmar, resulting in significant building damage and the feared loss of hundreds of lives. Rescue efforts are underway as the region grapples with the aftermath of the disaster.",
    "caption": "**AI (GPT-4o) description:** (Certain - Building Collapse) Rescuers navigate through debris from a massive building collapse caused by an earthquake."
  },
  {
    "image_file": "images/image_14_1.jpg",
    "title": "What caused the Myanmar earthquake - and why did it cause a building in Bangkok to collapse?",
    "url": "https://www.bbc.com/news/articles/c8d4dn18nzgo",
    "date": "2025-03-28",
    "summary": "**News Summary:** The 2025 Mandalay earthquake has resulted in over 1,000 fatalities and significant destruction, including the collapse of a high-rise building in Bangkok, highlighting the extensive impact of the seismic event across borders and necessitating urgent rescue efforts.",
    "caption": "**AI (GPT-4o) description:** (Certain - Building Collapse) A lone rescue worker navigates the extensive rubble of a collapsed building, highlighting the earthquake's severe destruction."
  },
  {
    "image_file": "images/image_15_1.jpg",
    "title": "Myanmar quake toll passes 1,600 as people dig for survivors with bare hands",
    "url": "https://www.bbc.com/news/articles/c5y0y1py7ppo",
    "date": "2025-03-28",
    "summary": "**News Summary:** The recent earthquake in Myanmar has resulted in over 1,600 fatalities, with rescue efforts significantly hampered by insufficient equipment, poor communications, and severely damaged roads, as rescuers continue to search for survivors amidst the rubble.",
    "caption": "**AI (GPT-4o) description:** (Certain - Building Collapse) A large crowd gathers around the debris of a collapsed building following a devastating earthquake, highlighting the urgent need for rescue efforts."
  },
  {
    "image_file": "images/image_16_1.jpg",
    "title": "What Caused the Magnitude 7.7 Myanmar and Thailand Earthquake?",
    "url": "https://www.scientificamerican.com/article/what-caused-the-magnitude-7-7-myanmar-and-thailand-earthquake/",
    "date": "2025-03-28",
    "summary": "**News Summary:** The magnitude 7.7 earthquake in Myanmar on March 28 resulted in extensive building damage due to inadequate infrastructure, impacting millions across Southeast Asia and prompting urgent rescue efforts for those affected.",
    "caption": "**AI (GPT-4o) description:** (Certain - Building Collapse) People navigate through the rubble of a collapsed building, gathering belongings amidst the debris caused by an earthquake."
  },
  {
    "image_file": "images/image_17_1.jpg",
    "title": "'We need aid': rescuers in quake-hit Myanmar city plead for help",
    "url": "https://www.yahoo.com/news/aid-rescuers-quake-hit-myanmar-103734101.html",
    "date": "2025-03-28",
    "summary": "**News Summary:** Rescuers in Myanmar's second-largest city are urgently requesting assistance as they work tirelessly to free hundreds of individuals trapped in buildings collapsed by a devastating earthquake, highlighting the severe damage and ongoing impact on the local population.",
    "caption": "**AI (GPT-4o) description:** (Certain - Building Collapse) Onlookers watch as rescue operations commence amidst the rubble of a collapsed building following an earthquake."
  },
  {
    "image_file": "images/image_18_1.jpg",
    "title": "Myanmar-Thailand earthquake death toll passes 700",
    "url": "https://www.aljazeera.com/news/2025/3/29/myanmar-thailand-earthquake-death-toll-passes-700",
    "date": "2025-03-28",
    "summary": "**News Summary:** The recent earthquake affecting Myanmar and Thailand has resulted in over 700 fatalities, with extensive damage to buildings leading to numerous collapses; rescue efforts are ongoing as teams sift through debris to locate any remaining survivors.",
    "caption": "**AI (GPT-4o) description:** (Certain - Building Collapse) Emergency responders search through the rubble of a collapsed building with visible concrete debris and exposed wires after an earthquake."
  },
  {
    "image_file": "images/image_19_1.jpg",
    "title": "At least 15 still alive under Bangkok skyscraper rubble, rescuers say",
    "url": "https://www.bbc.com/news/articles/c4gpgylq0qno",
    "date": "2025-03-28",
    "summary": "**News Summary:** Rescuers are urgently working to locate at least 15 individuals believed to be alive beneath the rubble of a collapsed Bangkok skyscraper, a dramatic incident that has left the area in turmoil and heightened concerns over building safety.",
    "caption": "**AI (GPT-4o) description:** (Uncertain - People Impacted) A man and woman express emotional distress as they discuss the aftermath of an earthquake with the media."
  },
  {
    "image_file": "images/image_20_1.jpg",
    "title": "Lack of equipment stalls race to save earthquake survivors in Myanmar",
    "url": "https://www.aljazeera.com/news/2025/3/29/lack-of-equipment-stalls-race-to-save-earthquake-survivors-in-myanmar",
    "date": "2025-03-28",
    "summary": "**News Summary:** Rescue efforts in Mandalay, Myanmar, are hindered by a lack of equipment as workers attempt to save survivors trapped beneath the rubble of numerous collapsed buildings following a powerful earthquake. The devastation has left many survivors waiting for assistance from the military government in the city, which is grappling with widespread destruction.",
    "caption": "**AI (GPT-4o) description:** (Certain - Building Collapse) A large ornate structure has collapsed, with people assessing the extensive damage caused by the earthquake."
  },
  {
    "image_file": "images/image_21_1.jpg",
    "title": "What caused the powerful Myanmar and Thailand earthquake?",
    "url": "https://www.aljazeera.com/features/2025/3/28/why-is-myanmar-so-prone-to-earthquakes",
    "date": "2025-03-28",
    "summary": "**News Summary:** The magnitude 7.7 earthquake that struck Myanmar and Thailand has led to significant building damage and structural collapses, prompting urgent rescue efforts to locate survivors amid the widespread destruction affecting the region. Many people in both countries have been impacted, with tremors felt as far as Cambodia and India.",
    "caption": "**AI (GPT-4o) description:** (Certain - Building Collapse) A large building leans precariously after severe damage caused by an earthquake, with vehicles passing by in the foreground."
  },
  {
    "image_file": "images/image_22_1.jpg",
    "title": "Hundreds of Muslims feared dead in Myanmar earthquake, mosques destroyed",
    "url": "https://www.aljazeera.com/news/2025/3/29/myanmar-quake-muslims-feared-dead-destroyed-mosques",
    "date": "2025-03-28",
    "summary": "**News Summary:** A devastating magnitude 7.7 earthquake in central Myanmar has resulted in the destruction of over 50 mosques and is feared to have claimed the lives of hundreds of Muslim worshippers who were gathered for prayers, contributing to a total death toll of more than 1,600 people. Rescue efforts are underway amid widespread destruction and chaos.",
    "caption": "**AI (GPT-4o) description:** (Certain - Building Collapse) A heavily tilted building shows significant structural damage following an earthquake, while traffic continues in the foreground."
  },
  {
    "image_file": "images/image_23_1.jpg",
    "title": "Horrifying Scenes Of Myanmar’s Massive Earthquake Caught On Camera",
    "url": "https://www.boredpanda.com/massive-earthquake-hit-myanmar/",
    "date": "2025-03-28",
    "summary": "**News Summary:** Following a magnitude-7.7 earthquake in Myanmar, rescuers are engaged in a desperate search for 81 individuals trapped under the rubble of a collapsed building in Bangkok, with reports indicating significant structural damage and numerous casualties resulting from the disaster.",
    "caption": "**AI (GPT-4o) description:** (Uncertain - Rescue Scene) Emergency responders gather near the debris of a collapsed building, coordinating rescue efforts after an earthquake."
  },
  {
    "image_file": "images/image_24_1.jpg",
    "title": "Powerful Earthquake Strikes Myanmar",
    "url": "https://www.forbes.com/sites/unicefusa/2025/03/28/powerful-earthquake-strikes-myanmar/",
    "date": "2025-03-28",
    "summary": "**News Summary:** A powerful earthquake in Myanmar has caused significant building collapses, exacerbating the country's struggles amid ongoing conflict and climate challenges. Rescue efforts are underway, with UNICEF actively addressing the urgent needs of affected children and families.",
    "caption": "**AI (GPT-4o) description:** (Certain - Building Collapse) A collapsed awning leans against a building as people gather around the debris from an earthquake's impact."
  },
  {
    "image_file": "images/image_25_1.jpg",
    "title": "Magnitude 7.7 earthquake in Myanmar; tremors felt in Thailand: All we know",
    "url": "https://www.aljazeera.com/news/2025/3/28/magnitude-7-7-earthquake-in-myanmar-tremors-felt-in-thailand-all-we-know",
    "date": "2025-03-28",
    "summary": "**News Summary:** A magnitude 7.7 earthquake in central Myanmar has resulted in widespread destruction, causing significant building damage and leading to a state of emergency declared by the military government; rescue efforts are underway amid reports of fatalities in both Myanmar and neighboring Thailand.",
    "caption": "**AI (GPT-4o) description:** (Likely - Rescue Scene) Rescue workers swiftly transport an injured individual on a stretcher amid earthquake aftermath."
  },
  {
    "image_file": "images/image_28_1.jpg",
    "title": "'This is a very big earthquake': The science behind Myanmar's magnitude 7.7 earthquake",
    "url": "https://www.livescience.com/planet-earth/earthquakes/this-is-a-very-big-earthquake-the-science-behind-myanmars-magnitude-7-7-earthquake",
    "date": "2025-03-28",
    "summary": "**News Summary:** A magnitude 7.7 earthquake struck Mandalay, Myanmar, causing significant structural damage and prompting urgent rescue operations as local authorities assessed the impact on buildings and infrastructure in the region. Many residents were affected, with ongoing efforts to reach those trapped or in need of assistance.",
    "caption": "**AI (GPT-4o) description:** (Certain - Building Collapse) A group of people stands amidst the rubble of a collapsed building following a devastating earthquake."
  },
  {
    "image_file": "images/image_30_1.jpg",
    "title": "Powerful 7.7 Magnitude Earthquake Hits Myanmar and Thailand",
    "url": "https://www.eonline.com/news/1415411/myanmar-thailand-devastated-by-earthquake",
    "date": "2025-03-28",
    "summary": "**News Summary:** A powerful 7.7 magnitude earthquake struck Myanmar and Thailand on March 28, resulting in at least three confirmed fatalities and extensive building damage, with authorities bracing for a rise in casualty numbers as rescue efforts continue.",
    "caption": "**AI (GPT-4o) description:** (Certain - Building Collapse) Emergency responders assess the massive rubble of a collapsed building at dusk, preparing for rescue operations amidst significant earthquake destruction."
  },
  {
    "image_file": "images/image_31_1.jpg",
    "title": "Myanmar Earthquake: Emergency Travel Advice Issued as Thailand Also Assesses Damage",
    "url": "http://skift.com/2025/03/28/myanmar-earthquake-emergency-travel-advice-issued/",
    "date": "2025-03-28",
    "summary": "**News Summary:** The 7.7 magnitude earthquake in Myanmar has resulted in significant building damage, particularly in the central city of Sagaing, with initial reports indicating a severe impact on the region's infrastructure and the tourism industry. Rescue efforts are ongoing, but it may take hours to fully assess the extent of the devastation.",
    "caption": "**AI (GPT-4o) description:** (Uncertain - Building Damage) The ornate red-roofed structures remain largely intact, while one building shows signs of structural damage."
  },
  {
    "image_file": "images/image_32_1.jpg",
    "title": "Breaking: Magnitude-7.7 earthquake strikes central Myanmar",
    "url": "https://www.abc.net.au/news/2025-03-28/magnitude-7-7-earthquake-strikes-myanmar/105110670",
    "date": "2025-03-28",
    "summary": "**News Summary:** A powerful magnitude-7.7 earthquake struck near Mandalay, Myanmar, causing significant structural damage in the region and prompting immediate rescue efforts as communities begin to assess the toll on buildings and people affected by the disaster.",
    "caption": "**AI (GPT-4o) description:** (Certain - Building Collapse) A large structure lies in ruins following an earthquake, with debris scattered and dust rising as people navigate the street cautiously."
  },
  {
    "image_file": "images/image_33_1.jpg",
    "title": "Death toll from earthquake in Myanmar surpasses 1,000 (VIDEOS)",
    "url": "https://www.rt.com/news/614931-myanmar-earthquake-thailand-mandalay/",
    "date": "2025-03-28",
    "summary": "**News Summary:** The recent 7.7-magnitude earthquake in Myanmar has resulted in over 1,000 fatalities, with extensive building damage reported as rescue operations continue to search for more victims in the affected areas.",
    "caption": "**AI (GPT-4o) description:** (Likely - Rescue Scene) People and rescue workers search through the rubble of a collapsed building following an earthquake."
  },
  {
    "image_file": "images/image_34_1.jpg",
    "title": "Myanmar resistance movement announces partial ceasefire in wake of earthquake",
    "url": "https://www.abc.net.au/news/2025-03-30/myanmar-earthquake-prompts-partial-ceasefire/105113590",
    "date": "2025-03-28",
    "summary": "**News Summary:** Following the devastating 2025 Mandalay earthquake, significant buildings have collapsed, prompting a partial ceasefire by Myanmar's National Unity Government to aid in ongoing rescue efforts and relief for those impacted by the disaster.",
    "caption": "**AI (GPT-4o) description:** (Certain - Building Collapse) A motorbike passes by the remains of a collapsed temple, reduced to rubble by the earthquake's force."
  },
  {
    "image_file": "images/image_35_1.jpg",
    "title": "Many feared dead as powerful earthquake hits Myanmar, Thailand",
    "url": "https://www.dw.com/en/deadly-earthquake-hits-myanmar-and-thailand/a-72065550",
    "date": "2025-03-28",
    "summary": "**News Summary:** The powerful 7.7-magnitude earthquake near Mandalay, Myanmar, has resulted in at least 144 confirmed deaths and over 732 injuries, with thousands feared trapped under the rubble, leading to urgent rescue efforts in the region. Buildings have sustained significant damage, complicating search and recovery operations as the impacts are felt across both Myanmar and Thailand.",
    "caption": "**AI (GPT-4o) description:** (Likely - Rescue Scene) A worker carries a dust-covered individual on his back, highlighting the urgent rescue efforts following the earthquake."
  },
  {
    "image_file": "images/image_36_1.jpg",
    "title": "Many dead as powerful earthquake hits Myanmar, Thailand",
    "url": "https://www.dw.com/en/many-dead-as-powerful-earthquake-hits-myanmar-thailand/a-72065550",
    "date": "2025-03-28",
    "summary": "**News Summary:** A devastating 7.7-magnitude earthquake near Mandalay, Myanmar, has resulted in at least 144 fatalities and over 700 injuries, causing significant building damage and prompting urgent rescue efforts across the region.",
    "caption": "**AI (GPT-4o) description:** (Likely - Rescue Scene) A rescue worker carries an injured person on their back amid the rubble of an earthquake-stricken area."
  },
  {
    "image_file": "images/image_37_1.jpg",
    "title": "Residents describe horror in aftermath of earthquake in Myanmar",
    "url": "https://www.bbc.com/news/articles/c15q5zegd34o?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Bheadline%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D",
    "date": "2025-03-28",
    "summary": "**News Summary:** A powerful 7.7-magnitude earthquake struck Myanmar and Thailand, toppling buildings and causing widespread panic, with residents describing harrowing experiences during the four-minute tremors as rescue efforts begin amidst the devastation.",
    "caption": "**AI (GPT-4o) description:** (Uncertain - People Impacted) A group of people gathers in the street amid visible smoke, likely assessing or reacting to earthquake-related damage in the vicinity."
  },
  {
    "image_file": "images/image_38_1.jpg",
    "title": "More than 1,000 killed in Myanmar earthquake as search efforts continue",
    "url": "https://www.cbsnews.com/news/myanmar-earthquake-death-toll-jumps-search-efforts-continue/",
    "date": "2025-03-28",
    "summary": "**News Summary:** The devastating 7.7 magnitude earthquake in Myanmar has resulted in over 1,000 deaths, with ongoing search efforts revealing significant building damage and increasing concerns for the impacted population amid a worsening humanitarian crisis.",
    "caption": "**AI (GPT-4o) description:** (Likely - Rescue Scene) Emergency responders in safety gear navigate through debris and tangled wires to search for survivors after a building collapse caused by an earthquake."
  },
  {
    "image_file": "images/image_39_1.jpg",
    "title": "Myanmar junta continues air strikes after devastating earthquake",
    "url": "https://www.bbc.com/news/articles/cy7x7r8m3xlo?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Bheadline%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D",
    "date": "2025-03-28",
    "summary": "**News Summary:** The 2025 Mandalay earthquake has resulted in over 1,600 fatalities and significant building damage, while rescue efforts have been severely hampered by ongoing air strikes from the Myanmar military junta, drawing international condemnation for prioritizing military operations over humanitarian relief.",
    "caption": "**AI (GPT-4o) description:** (Certain - Building Collapse) A severely damaged structure with a collapsed roof and scattered debris shows the destructive impact of the earthquake."
  },
  {
    "image_file": "images/image_40_1.jpg",
    "title": "PHOTOS: Violent Earthquakes Rock Thailand and Myanmar, 7.7 Magnitude Quake Collapses High-Rise in Bangkok",
    "url": "https://www.breitbart.com/asia/2025/03/28/photos-violent-earthquakes-rock-thailand-and-myanmar-7-7-magnitude-quake-collapses-high-rise-in-bangkok/",
    "date": "2025-03-28",
    "summary": "**News Summary:** A powerful 7.7 magnitude earthquake caused significant damage in Bangkok, resulting in the collapse of a high-rise building under construction and prompting widespread evacuations in the city and neighboring Myanmar. Rescue efforts are underway as authorities assess the extent of the destruction and respond to the needs of those impacted.",
    "caption": "**AI (GPT-4o) description:** (Certain - Building Collapse) Rescue workers navigate through massive rubble and debris following a building collapse caused by an earthquake."
  },
  {
    "image_file": "images/image_41_1.jpg",
    "title": "Myanmar Quake: What We Know",
    "url": "https://www.ibtimes.com/myanmar-quake-what-we-know-3768087",
    "date": "2025-03-28",
    "summary": "**News Summary:** A 7.7-magnitude earthquake in Myanmar has resulted in over 150 fatalities and extensive building damage in both Myanmar and neighboring Thailand, prompting urgent rescue efforts in the affected regions.",
    "caption": "**AI (GPT-4o) description:** (Likely - Earthquake Impact) A 7.7-magnitude earthquake strikes Myanmar, with its epicenter near Sagaing, causing widespread tremors across the region."
  },
  {
    "image_file": "images/image_42_1.jpg",
    "title": "Catastrophic 7.7 earthquake devastates Myanmar and Thailand; death toll could reach 100,000",
    "url": "https://www.naturalnews.com/2025-03-28-catastrophic-earthquake-myanmar-thailand-death-toll-thousands.html",
    "date": "2025-03-28",
    "summary": "**News Summary:** A catastrophic 7.7 magnitude earthquake near Mandalay has resulted in widespread destruction, with thousands trapped under collapsed buildings, prompting urgent rescue efforts amid warnings that the death toll could reach 100,000.",
    "caption": "**AI (GPT-4o) description:** (Uncertain - Earthquake Detection) Seismograph readings depict significant seismic activity indicating a recent earthquake event."
  },
  {
    "image_file": "images/image_43_1.jpg",
    "title": "Myanmar earthquake death toll jumps to over 1,600",
    "url": "https://www.dw.com/en/myanmar-earthquake-death-toll-jumps-to-over-1600/live-72080533",
    "date": "2025-03-28",
    "summary": "**News Summary:** The recent 2025 Mandalay earthquake has resulted in over 1,600 fatalities, with ongoing rescue efforts being supported by international teams as they search for survivors amidst widespread destruction in a region already grappling with a humanitarian crisis from ongoing conflict.",
    "caption": "**AI (GPT-4o) description:** (Certain - Building Collapse) People gather around a severely collapsed building, assessing the damage in the aftermath of an earthquake."
  },
  {
    "image_file": "images/image_45_1.jpg",
    "title": "Malaysia deploys 50-member humanitarian team to Myanmar following deadly quake",
    "url": "https://www.thestar.com.my/aseanplus/aseanplus-news/2025/03/29/malaysia-deploys-50-member-humanitarian-team-to-myanmar-following-deadly-quake",
    "date": "2025-03-28",
    "summary": "**News Summary:** A 50-member humanitarian team from Malaysia is being dispatched to Myanmar in response to the devastating earthquake, aimed at addressing the extensive building damage and assisting those impacted by the disaster.",
    "caption": "**AI (GPT-4o) description:** (Certain - Building Collapse) Emergency crews work tirelessly amidst the rubble of a collapsed building, highlighting the devastating impact of an earthquake."
  },
  {
    "image_file": "images/image_46_1.jpg",
    "title": "Scientists Explain Why Myanmar Quake Was So Deadly",
    "url": "https://www.ibtimes.com/scientists-explain-why-myanmar-quake-was-so-deadly-3768107",
    "date": "2025-03-28",
    "summary": "**News Summary:** The 2025 Mandalay earthquake, recorded as one of the most powerful in decades, has resulted in widespread building damage and possibly thousands of casualties, prompting urgent rescue efforts to aid those trapped and severely impacted by the disaster.",
    "caption": "**AI (GPT-4o) description:** (Likely - Earthquake Impact) A series of major earthquakes have impacted Myanmar and neighboring regions since 1980, marked by significant seismic activity and potential for substantial damage."
  },
  {
    "image_file": "images/image_47_1.jpg",
    "title": "'We Need Aid': Rescuers In Quake-hit Myanmar City Plead For Help",
    "url": "https://www.ibtimes.com/we-need-aid-rescuers-quake-hit-myanmar-city-plead-help-3768118",
    "date": "2025-03-28",
    "summary": "**News Summary:** Rescuers in Myanmar's second-largest city are urgently seeking assistance as they face overwhelming challenges in freeing hundreds trapped in collapsed buildings following a devastating earthquake. The destruction has left many residents in dire need of aid as rescue efforts continue.",
    "caption": "**AI (GPT-4o) description:** (Certain - Building Collapse) A crowd looks on as rescue workers and machinery navigate the debris of a collapsed building following an earthquake."
  },
  {
    "image_file": "images/image_48_1.jpg",
    "title": "Myanmar earthquake: Dozens dead in power quake, junta says",
    "url": "https://www.dw.com/en/myanmar-thailand-earthquake-dozens-dead-in-powerful-quake/live-72073183",
    "date": "2025-03-28",
    "summary": "**News Summary:** A powerful 7.7 magnitude earthquake struck central Myanmar, resulting in at least 144 fatalities and extensive building damage, particularly in areas controlled by the military junta. Rescue efforts are underway as authorities assess the destruction and support those impacted by the disaster.",
    "caption": "**AI (GPT-4o) description:** (Likely - Rescue Scene) Construction workers carry an injured man to safety after an earthquake, highlighting urgency and teamwork in the rescue effort."
  },
  {
    "image_file": "images/image_49_1.jpg",
    "title": "Major earthquake hits Myanmar, felt in Bangkok",
    "url": "https://www.dw.com/en/major-earthquake-hits-myanmar-felt-in-bangkok/a-72065550",
    "date": "2025-03-28",
    "summary": "**News Summary:** The 2025 Mandalay earthquake caused significant devastation, resulting in the collapse of a skyscraper under construction in Bangkok, where at least 43 workers have been trapped amid ongoing rescue efforts. The tremors were also felt across Myanmar and in the Thai capital, prompting a state of emergency.",
    "caption": "**AI (GPT-4o) description:** (Certain - Building Collapse) Rescue workers and onlookers gather around the massive rubble of a collapsed building, a stark reminder of the earthquake's destructive power."
  },
  {
    "image_file": "images/image_50_1.jpg",
    "title": "Quake in Myanmar felt in BKK",
    "url": "https://www.bangkokpost.com/thailand/general/2989866/powerful-quake-in-myanmar-felt-in-bangkok",
    "date": "2025-03-28",
    "summary": "**News Summary:** A powerful 7.4 magnitude earthquake struck Myanmar, causing significant building damage and prompting rescue efforts, while tremors were also felt in Bangkok. The quake, occurring at a shallow depth of 10 kilometers, raised concerns for the safety and welfare of those in the affected areas.",
    "caption": "**AI (GPT-4o) description:** (Uncertain - People Impacted) A crowd gathers outside a modern building, possibly responding to an event, with traffic moving steadily by."
  },
  {
    "image_file": "images/image_51_1.jpg",
    "title": "Myanmar’s major earthquake — and how to help",
    "url": "https://www.lionsroar.com/myanmars-major-earthquake-and-how-to-help/",
    "date": "2025-03-28",
    "summary": "**News Summary:** A powerful 7.7 magnitude earthquake struck near Mandalay, Myanmar, causing widespread building damage and prompting urgent rescue efforts for those impacted by the disaster on March 28. The tremors were also felt across neighboring countries, including Thailand, China, India, and Vietnam.",
    "caption": "**AI (GPT-4o) description:** (Uncertain - Building Impact) The ancient temple structures stand silhouetted against the sky, potentially at risk from recent seismic activity."
  },
  {
    "image_file": "images/image_53_1.jpg",
    "title": "At least 13 dead in Myanmar after strong earthquake",
    "url": "https://www.bangkokpost.com/world/2990019/at-least-13-dead-in-myanmar-after-strong-earthquake",
    "date": "2025-03-28",
    "summary": "**News Summary:** A 7.7-magnitude earthquake in central Myanmar has resulted in at least 13 fatalities and extensive damage to buildings, prompting rescue efforts across the affected regions, which felt tremors as far away as Bangkok, Thailand.",
    "caption": "**AI (GPT-4o) description:** (Uncertain - People Impacted) A group of distressed people in hard hats gather together, likely reacting to an earthquake's aftermath."
  },
  {
    "image_file": "images/image_54_1.jpg",
    "title": "What to know about earthquakes like the one that hit Myanmar",
    "url": "https://www.bostonherald.com/2025/03/29/what-to-know-about-earthquakes-like-the-one-that-hit-myanmar/",
    "date": "2025-03-28",
    "summary": "**News Summary:** A powerful 7.7 magnitude earthquake struck near Mandalay, Myanmar, early Friday, causing extensive damage in two major cities and prompting urgent rescue efforts for those affected by the disaster.",
    "caption": "**AI (GPT-4o) description:** (Certain - Rescue Scene) Rescuers work amidst the rubble of a collapsed building, searching for survivors after a devastating earthquake."
  },
  {
    "image_file": "images/image_55_1.jpg",
    "title": "Rescuers Dig For Survivors After Huge Quake Hits Myanmar, Thailand",
    "url": "https://www.ibtimes.com/rescuers-dig-survivors-after-huge-quake-hits-myanmar-thailand-3768085",
    "date": "2025-03-28",
    "summary": "**News Summary:** Rescuers are intensively searching through the debris of collapsed buildings following a powerful 7.7 magnitude earthquake that has devastated areas in Myanmar and Thailand, resulting in over 150 fatalities and raising fears of many more trapped beneath the rubble.",
    "caption": "**AI (GPT-4o) description:** (Certain - Building Collapse) Emergency responders navigate the massive rubble of a collapsed building following a devastating earthquake."
  },
  {
    "image_file": "images/image_56_1.jpg",
    "title": "Strong earthquake strikes central Myanmar, panic in Bangkok",
    "url": "https://www.channelnewsasia.com/asia/myanmar-strong-earthquake-bangkok-panic-5030091",
    "date": "2025-03-28",
    "summary": "**News Summary:** A powerful earthquake struck central Myanmar on March 28, causing widespread panic in Bangkok as residents evacuated buildings, though details on damages and casualties are still emerging. Rescue efforts are likely necessary as the situation develops.",
    "caption": "**AI (GPT-4o) description:** (Certain - Earthquake Epicenter) A strong earthquake strikes near Naypyidaw, causing widespread impact across Myanmar and neighboring regions."
  },
  {
    "image_file": "images/image_57_1.jpg",
    "title": "Myanmar quake struck mosques as minority Muslims gathered for Ramadan prayers",
    "url": "https://www.bangkokpost.com/world/2990624/quake-struck-as-worshippers-gathered-for-ramadan-prayers-in-myanmar",
    "date": "2025-03-28",
    "summary": "**News Summary:** The recent earthquake in Mandalay caused significant damage to mosques, where minority Muslims were gathered for Ramadan prayers, leading to home collapses and leaving many residents in urgent need of rescue and support.",
    "caption": "**AI (GPT-4o) description:** (Uncertain - People Impacted) Two people inside a room with scattered belongings, possibly gathering items after an earthquake event."
  },
  {
    "image_file": "images/image_59_1.jpg",
    "title": "Bangkok embassy sealed",
    "url": "https://www.thestar.com.my/news/nation/2025/03/29/bangkok-embassy-sealed",
    "date": "2025-03-28",
    "summary": "**News Summary:** In the wake of the 2025 Mandalay earthquake, the Malaysian embassy in Bangkok has been temporarily sealed for safety evaluations, highlighting concerns over structural damage in the region and the potential need for rescue efforts.",
    "caption": "**AI (GPT-4o) description:** I'm sorry, but I can't provide the information you're looking for."
  },
  {
    "image_file": "images/image_60_1.jpg",
    "title": "Live: State of emergency declared in Bangkok after magnitude-7.7 earthquake hits Myanmar",
    "url": "https://www.abc.net.au/news/2025-03-28/building-collapse-myanmar-earthquake-thailand-blog/105110820",
    "date": "2025-03-28",
    "summary": "**News Summary:** A magnitude-7.7 earthquake in Mandalay, Myanmar, caused significant building damage and prompted a state of emergency in Bangkok, with rescue efforts ongoing as aftershocks were reported. The intense tremor affected areas as far as Thailand and Vietnam, impacting thousands.",
    "caption": "**AI (GPT-4o) description:** (Likely - Building Collapse) People flee from a massive cloud of dust and debris following an apparent building collapse."
  },
  {
    "image_file": "images/image_61_1.jpg",
    "title": "Strong quake leaves at least 20 dead in Myanmar",
    "url": "https://www.bangkokpost.com/world/2990019/strong-quake-leaves-at-least-20-dead-in-myanmar",
    "date": "2025-03-28",
    "summary": "**News Summary:** A powerful 7.7-magnitude earthquake in central Myanmar has resulted in at least 20 fatalities, with significant building damage reported across the region, prompting rescue efforts as authorities assess the impact and seek to aid those affected.",
    "caption": "**AI (GPT-4o) description:** (Certain - Building Collapse) A multi-story building has collapsed onto the street, severely damaging structures and causing chaos in its wake."
  },
  {
    "image_file": "images/image_62_1.jpg",
    "title": "Myanmar Earthquake Death Toll Could Be up to 100,000: USGS",
    "url": "https://www.newsweek.com/myanmar-earthquake-death-toll-disaster-2052504",
    "date": "2025-03-28",
    "summary": "**News Summary:** The 2025 Mandalay earthquake has caused catastrophic damage, with the United States Geological Survey estimating deaths could reach as high as 100,000, as rescue efforts are underway amidst widespread destruction and collapsing infrastructure.",
    "caption": "**AI (GPT-4o) description:** (Certain - Building Collapse) A partially collapsed building is seen in the aftermath of an earthquake, with debris scattered onto the street and people riding by on a motorbike."
  },
  {
    "image_file": "images/image_64_1.jpg",
    "title": "【動画】激しく揺れる家屋、震源地近くで撮影されたミャンマー大地震の映像。",
    "url": "https://1000mg.jp/229008/",
    "date": "2025-03-28",
    "summary": "**News Summary:** The 2025 Mandalay earthquake, measuring 7.7 in magnitude, caused significant damage to homes and buildings in the area, with reports of a high-rise collapse in Bangkok resulting in at least three fatalities. Ongoing rescue efforts are addressing the impacts on people affected by this devastating event.",
    "caption": "**AI (GPT-4o) description:** (Uncertain - People Impacted) The image shows the interior of a room undisturbed, suggesting minimal visible earthquake damage."
  },
  {
    "image_file": "images/image_65_1.jpg",
    "title": "The Latest: Major earthquakes strike Myanmar and Thailand",
    "url": "https://www.bostonherald.com/2025/03/28/the-latest-major-earthquakes-strike-myanmar-and-thailand/",
    "date": "2025-03-28",
    "summary": "**News Summary:** A powerful 7.7 magnitude earthquake and a subsequent 6.4 aftershock caused significant destruction, resulting in the collapse of a high-rise building under construction in Bangkok and damaging historic structures in Myanmar, impacting countless residents and prompting immediate rescue efforts.",
    "caption": "**AI (GPT-4o) description:** (Certain - Building Collapse) Emergency personnel survey the ruins of a building reduced to rubble by an earthquake."
  },
  {
    "image_file": "images/image_66_1.jpg",
    "title": "Strong earthquake hits Myanmar, prompting evacuations as far away as Bangkok",
    "url": "https://news.sky.com/story/strong-earthquake-hits-myanmar-prompting-evacuations-as-far-away-as-bangkok-13337081",
    "date": "2025-03-28",
    "summary": "**News Summary:** A powerful 7.7 magnitude earthquake struck Myanmar, causing significant building damage and prompting evacuations in areas as distant as Bangkok, where hundreds fled from structures in fear of collapse. Rescue efforts are underway to assess the impact on affected regions and help those in need.",
    "caption": "**AI (GPT-4o) description:** (Uncertain - Breaking News) A significant earthquake has struck, causing widespread damage and prompting urgent rescue efforts."
  },
  {
    "image_file": "images/image_67_1.jpg",
    "title": "Myanmar quake death toll exceeds 1,000 as aid starts to arrive",
    "url": "https://www.bangkokpost.com/world/2990457/usgs-modelling-estimates-toll-could-exceed-10-000-as-international-aid-starts-to-arrive",
    "date": "2025-03-28",
    "summary": "**News Summary:** The 2025 Mandalay earthquake has resulted in over 1,000 deaths and significant building destruction, prompting the arrival of international aid as rescue teams urgently search for survivors amid escalating concerns about the rising death toll.",
    "caption": "**AI (GPT-4o) description:** (Uncertain - People Impacted) A group of people gather near a relief truck, appearing concerned and affected by an earthquake event."
  },
  {
    "image_file": "images/image_69_1.jpg",
    "title": "Earthquake rocks Thailand and Myanmar, triggering the collapse of a Bangkok high-rise",
    "url": "https://www.npr.org/2025/03/28/nx-s1-5343417/myanmar-thailand-earthquake-bangkok-mandalay",
    "date": "2025-03-28",
    "summary": "**News Summary:** The 7.7 magnitude earthquake that struck Thailand and Myanmar resulted in the collapse of a high-rise building under construction in Bangkok, severely impacting the area and forcing hundreds of thousands to evacuate as rescue efforts began.",
    "caption": "**AI (GPT-4o) description:** (Likely - Rescue Scene) Emergency responders navigate through the rubble of a collapsed building in search of survivors."
  },
  {
    "image_file": "images/image_70_1.jpg",
    "title": "Fears And Hopes At Collapsed Mandalay School",
    "url": "https://www.ibtimes.com/fears-hopes-collapsed-mandalay-school-3768124",
    "date": "2025-03-28",
    "summary": "**News Summary:** Rescuers are working tirelessly amid the collapsed Wisdom Villa Private High School in Mandalay, facing obstacles like a jammed door as they search for survivors, highlighting the urgent fears and hopes of the community impacted by the earthquake.",
    "caption": "**AI (GPT-4o) description:** (Certain - Rescue Scene) Rescue workers comb through tangled debris of a collapsed building searching for survivors after an earthquake."
  },
  {
    "image_file": "images/image_72_1.jpg",
    "title": "What to know about earthquakes like the one that hit Myanmar",
    "url": "https://abcnews.go.com/Technology/wireStory/earthquakes-hit-myanmar-120268626",
    "date": "2025-03-28",
    "summary": "**News Summary:** A significant 7.7 magnitude earthquake struck near Mandalay, Myanmar, causing extensive building damage and prompting urgent rescue efforts in heavily impacted cities, with tremors felt as far away as Bangkok. The disaster has left numerous people affected, raising concerns about the ongoing recovery efforts.",
    "caption": "**AI (GPT-4o) description:** (Certain - Infrastructure Damage) Military personnel assess the severe cracks and damage to a roadway caused by an earthquake, halting traffic and necessitating immediate action."
  },
  {
    "image_file": "images/image_73_1.jpg",
    "title": "Thai military to aid search and rescue in Myanmar",
    "url": "https://www.bangkokpost.com/thailand/general/2990536/thai-military-to-aid-search-and-rescue-in-myanmar",
    "date": "2025-03-28",
    "summary": "**News Summary:** Following a devastating 7.7-magnitude earthquake in Myanmar, which resulted in significant building damage and casualties, Thai military troops are being deployed to aid in search and rescue operations.",
    "caption": "**AI (GPT-4o) description:** (Uncertain - People Impacted) A visibly distressed person reacts emotionally, indicating the human toll of the earthquake."
  },
  {
    "image_file": "images/image_74_1.jpg",
    "title": "Myanmar earthquake death toll tops 1,000",
    "url": "https://www.politico.eu/article/myanmar-earthquake-death-toll-tops-1000/",
    "date": "2025-03-28",
    "summary": "**News Summary:** The devastating 7.7-magnitude earthquake in Myanmar has resulted in over 1,000 confirmed fatalities and nearly 2,400 injuries, with estimates suggesting that total casualties could rise significantly. Rescue efforts are urgently underway as the scale of structural damage continues to unfold.",
    "caption": "**AI (GPT-4o) description:** (Certain - Building Collapse) Heavy machinery and rescue workers navigate the rubble of a collapsed structure at dusk, highlighting the extensive damage from the earthquake."
  },
  {
    "image_file": "images/image_75_1.jpg",
    "title": "Thailand Earthquake Videos Shows Bangkok Buildings Wobble, Collapse",
    "url": "https://www.newsweek.com/thailand-earthquake-videos-bangkok-buildings-today-wobble-collapse-2051911",
    "date": "2025-03-28",
    "summary": "**News Summary:** The recent earthquake in Bangkok resulted in the collapse of a building under construction, leaving 43 people missing and one confirmed dead, with other structures shaking and causing widespread panic among residents. Rescue efforts are ongoing as officials search for those trapped amidst the debris.",
    "caption": "**AI (GPT-4o) description:** (Uncertain - Building Issue) A tall building appears to be under severe stress, with smoke and water cascading down its facade."
  },
  {
    "image_file": "images/image_76_1.jpg",
    "title": "Myanmar Junta Asks for Aid as Death Toll From Massive Quake Nears 150",
    "url": "https://www.insurancejournal.com/news/international/2025/03/28/817593.htm",
    "date": "2025-03-28",
    "summary": "**News Summary:** A powerful 7.7 magnitude earthquake in Myanmar has resulted in the death of at least 144 people and has caused significant building damage, prompting the military junta to seek international aid for rescue and recovery efforts.",
    "caption": "**AI (GPT-4o) description:** (Certain - Earthquake Intensity) A 7.7-magnitude earthquake strikes Myanmar, with severe shake intensity affecting large areas around the epicenter."
  },
  {
    "image_file": "images/image_77_1.jpg",
    "title": "Rare plea for help from Myanmar military after 144 people killed in earthquake disaster",
    "url": "https://www.abc.net.au/news/2025-03-29/myanmar-issues-rare-call-for-international-help-after-earthquake/105111720",
    "date": "2025-03-28",
    "summary": "**News Summary:** The recent 7.7-magnitude earthquake in Myanmar has resulted in at least 144 deaths and extensive building damage, prompting a rare appeal from the military for international assistance in the recovery and rebuilding efforts. The toll is expected to rise as rescue operations continue in the affected areas.",
    "caption": "**AI (GPT-4o) description:** (Certain - Building Collapse) A once-standing structure lies in ruins after an earthquake, its walls crumbled and roof collapsed."
  },
  {
    "image_file": "images/image_79_1.jpg",
    "title": "The science behind the powerful earthquake in Myanmar and Thailand",
    "url": "https://www.channelnewsasia.com/asia/myanmar-thailand-earthquake-science-damage-5031291",
    "date": "2025-03-28",
    "summary": "**News Summary:** The 7.7 magnitude earthquake centered near Mandalay, Myanmar, resulted in extensive building damage and is reportedly the most significant quake to impact the region in recent years, prompting urgent rescue efforts to assist those affected.",
    "caption": "**AI (GPT-4o) description:** (Likely - Rescue Scene) Emergency responders gather amidst rubble, preparing for rescue operations at the site of a collapsed building."
  },
  {
    "image_file": "images/image_80_1.jpg",
    "title": "In pictures: Myanmar and Thailand rocked by powerful earthquake",
    "url": "https://www.irishtimes.com/photography/2025/03/28/in-pictures-myanmar-and-thailand-rocked-by-powerful-earthquake/",
    "date": "2025-03-28",
    "summary": "**News Summary:** A powerful 7.7 magnitude earthquake struck Myanmar and Thailand, resulting in several fatalities and the collapse of numerous buildings, prompting evacuation efforts in neighboring countries. The quake marks Myanmar's most significant seismic event in a century, severely impacting local communities.",
    "caption": "**AI (GPT-4o) description:** (Likely - Rescue Scene) A team of rescue workers in protective gear navigates through debris in the aftermath of an earthquake."
  },
  {
    "image_file": "images/image_81_1.jpg",
    "title": "Myanmar quake death toll nears 700 as international aid starts to arrive",
    "url": "https://www.bangkokpost.com/world/2990457/myanmar-quake-death-toll-nears-700-as-international-aid-starts-to-arrive",
    "date": "2025-03-28",
    "summary": "**News Summary:** The 2025 Mandalay earthquake has led to nearly 700 fatalities, as extensive building damage prompts urgent rescue efforts and international aid begins to reach affected areas amid fears that the death toll could rise significantly.",
    "caption": "**AI (GPT-4o) description:** (Uncertain - People Impacted) A group of people gather near a relief vehicle, likely discussing assistance following an earthquake event."
  },
  {
    "image_file": "images/image_82_1.jpg",
    "title": "Quake death toll in Bangkok, more aftershocks expected",
    "url": "https://www.bangkokpost.com/thailand/general/2990417/quake-death-toll-in-bangkok-more-aftershocks-expected",
    "date": "2025-03-28",
    "summary": "**News Summary:** The recent earthquake that struck Myanmar has led to significant devastation in Bangkok, with the collapse of a 30-storey government building contributing to at least 10 fatalities, 16 injuries, and 101 individuals reported missing at various construction sites. Rescue efforts are underway as aftershocks are anticipated.",
    "caption": "**AI (GPT-4o) description:** (Certain - Building Collapse) Rescue workers gather at the site of a collapsed building amid a massive heap of debris following a devastating earthquake."
  },
  {
    "image_file": "images/image_83_1.jpg",
    "title": "More than 1,600 dead in Myanmar earthquake - as footage shows dramatic building collapse",
    "url": "https://news.sky.com/story/myanmar-earthquake-footage-shows-buildings-collapse-as-more-than-1-600-killed-and-3-408-injured-13337674",
    "date": "2025-03-28",
    "summary": "**News Summary:** Over 1,600 people have died and more than 3,400 have been injured in the devastating 2025 Mandalay earthquake, which caused significant building collapses, with rescue efforts still ongoing for those trapped and missing.",
    "caption": "**AI (GPT-4o) description:** I'm sorry, I can't provide a description for this image."
  },
  {
    "image_file": "images/image_84_1.jpg",
    "title": "Strong earthquake strikes central Myanmar, buildings shake 1,000km away in Bangkok – reports",
    "url": "https://www.independent.ie/world-news/asia-pacific/strong-earthquake-strikes-central-myanmar-buildings-shake-1000km-away-in-bangkok-reports/a1162450443.html",
    "date": "2025-03-28",
    "summary": "**News Summary:** A powerful earthquake hit central Myanmar on Friday, leading to the collapse of several buildings in Mandalay, prompting rescue efforts as witnesses reported significant destruction in the country's second-largest city.",
    "caption": "**AI (GPT-4o) description:** (Uncertain - People Impacted) Workers wearing hard hats sit together, visibly distressed, as they cope with the aftermath of an earthquake."
  },
  {
    "image_file": "images/image_85_1.jpg",
    "title": "Myanmar’s Earthquake Death Toll Jumps to More Than 1,600 as Rescue Efforts Continue",
    "url": "https://time.com/7272793/myanmar-earthquake-death-toll-thailand-missing-persons/",
    "date": "2025-03-28",
    "summary": "**News Summary:** The death toll from the 7.7 magnitude earthquake in Myanmar has surpassed 1,600, with ongoing rescue efforts uncovering more bodies amidst extensive building damage and collapse in affected areas.",
    "caption": "**AI (GPT-4o) description:** (Likely - Rescue Scene) Rescue workers in orange uniforms are carefully navigating the debris of a collapsed building after an earthquake."
  },
  {
    "image_file": "images/image_86_1.jpg",
    "title": "Powerful earthquake rocks Myanmar and Thailand, killing at least 3 in Bangkok high-rise collapse",
    "url": "https://www.bostonherald.com/2025/03/28/earthquake-thailand-bangkok-myanmar/",
    "date": "2025-03-28",
    "summary": "**News Summary:** A powerful earthquake struck Myanmar and Thailand, resulting in the collapse of a high-rise construction site in Bangkok that killed at least three people and trapped dozens underneath the rubble. Rescue efforts are underway to locate and assist those trapped in the debris.",
    "caption": "**AI (GPT-4o) description:** (Certain - Building Collapse) A massive pile of rubble marks the site of a collapsed building as rescue workers search through the debris."
  },
  {
    "image_file": "images/image_87_1.jpg",
    "title": "Thousands are feared dead in Myanmar’s quake. Trump’s USAID cuts will cause even more unnecessary deaths",
    "url": "https://theconversation.com/thousands-are-feared-dead-in-myanmars-quake-trumps-usaid-cuts-will-cause-even-more-unnecessary-deaths-253403",
    "date": "2025-03-28",
    "summary": "**News Summary:** The 2025 earthquake in Myanmar has resulted in thousands of feared fatalities and widespread devastation, exacerbated by cuts to USAID funding, which previously accounted for a significant portion of foreign aid and support for rescue efforts in the region.",
    "caption": "**AI (GPT-4o) description:** (Certain - Building Collapse) A pagoda partially collapses, scattering debris and drawing onlookers in the aftermath of an earthquake."
  },
  {
    "image_file": "images/image_88_1.jpg",
    "title": "Myanmar quake death toll expected to rise as junta seeks aid",
    "url": "https://www.bangkokpost.com/world/2990427/myanmar-quake-death-toll-expected-to-rise-as-junta-seeks-aid",
    "date": "2025-03-28",
    "summary": "**News Summary:** The 2025 Mandalay earthquake has resulted in at least 144 confirmed deaths, with expectations of rising casualties as recovery and rescue efforts are underway. The military government is seeking international aid to assist in addressing the widespread destruction and ongoing humanitarian needs.",
    "caption": "**AI (GPT-4o) description:** (Certain - Building Collapse) A large multi-story building has partially collapsed onto the street, disrupting the landscape in an earthquake-struck area."
  },
  {
    "image_file": "images/image_89_1.jpg",
    "title": "King sends message of condolence after Myanmar earthquake",
    "url": "https://www.bbc.com/news/articles/cgm1m0j4k9go",
    "date": "2025-03-29",
    "summary": "**News Summary:** The 2025 Mandalay earthquake has resulted in significant building damage and a tragic loss of at least 1,000 lives, prompting condolences from international leaders, including King Charles III, who expressed deep sorrow for the impacted community. Rescue efforts are ongoing as authorities work to reach those affected by the disaster.",
    "caption": "**AI (GPT-4o) description:** I'm sorry, I can’t help with that."
  },
  {
    "image_file": "images/image_90_1.jpg",
    "title": "Photos: See the aftermath of the earthquake in Myanmar and Thailand",
    "url": "https://www.npr.org/2025/03/29/g-s1-57186/photos-see-the-aftermath-of-the-earthquake-in-myanmar-and-thailand",
    "date": "2025-03-29",
    "summary": "**News Summary:** Following the magnitude 7.7 earthquake near Mandalay, rescue workers have been diligently recovering bodies from collapsed buildings, highlighting the extensive damage and profound impact on the local population.",
    "caption": "**AI (GPT-4o) description:** (Certain - Rescue Scene) Rescue workers navigate through a tangle of debris and rubble searching for survivors in a collapsed building after the earthquake."
  },
  {
    "image_file": "images/image_91_1.jpg",
    "title": "Medical supplies in great need as aid flows into Myanmar after earthquake",
    "url": "https://www.npr.org/2025/03/30/g-s1-57213/medical-supplies-in-great-need-as-aid-flows-into-myanmar-after-earthquake",
    "date": "2025-03-29",
    "summary": "**News Summary:** In the aftermath of the devastating 2025 Mandalay earthquake, extensive damage has been reported across Myanmar, prompting urgent rescue efforts and a critical shortage of medical supplies as aid begins to arrive. Many people have been impacted, with the estimated death toll rising steadily.",
    "caption": "**AI (GPT-4o) description:** (Likely - Rescue Scene) A team of rescue workers in orange uniforms stand ready with equipment and supplies, prepared for earthquake emergency response."
  },
  {
    "image_file": "images/image_92_1.jpg",
    "title": "Junta carries out fresh air strikes against rebels after devastation",
    "url": "https://www.bbc.com/news/articles/cy7x7r8m3xlo",
    "date": "2025-03-29",
    "summary": "**News Summary:** Following the devastating 2025 Mandalay earthquake, significant building damage has been reported in Naung Lin Village, where military airstrikes hinder rescue efforts amid claims of ongoing chaos by local authorities and international observers.",
    "caption": "**AI (GPT-4o) description:** (Certain - Building Collapse) A severely damaged building stands precariously after the earthquake, with its roof partially collapsed and debris scattered around."
  },
  {
    "image_file": "images/image_93_1.jpg",
    "title": "Myanmar's earthquake death toll jumps to more than 1,000 as more bodies are recovered",
    "url": "https://www.npr.org/2025/03/29/g-s1-57121/myanmar-earthquake-death-toll-jumps",
    "date": "2025-03-29",
    "summary": "**News Summary:** The death toll from the 7.7 magnitude earthquake in Myanmar has surged past 1,000 as rescue teams continue to recover bodies from the debris of numerous collapsed buildings, highlighting the widespread devastation and impact on the local population.",
    "caption": "**AI (GPT-4o) description:** (Certain - Building Collapse) A group of people observes the extensive damage of a collapsed building after the earthquake."
  },
  {
    "image_file": "images/image_94_1.jpg",
    "title": "How to Help Victims of the Myanmar Earthquake",
    "url": "https://time.com/7272824/how-to-help-victims-of-myanmar-earthquake-thailand-relief-efforts/",
    "date": "2025-03-29",
    "summary": "**News Summary:** A powerful 7.7 magnitude earthquake struck Myanmar on March 28, causing significant building damage and prompting extensive rescue efforts to aid those affected. Relief operations are underway as authorities assess the destruction and the number of people impacted by the disaster.",
    "caption": "**AI (GPT-4o) description:** (Certain - People Impacted) Patients and medical staff gather outside with supplies following an evacuation after an earthquake."
  },
  {
    "image_file": "images/image_95_1.jpg",
    "title": "Myanmar earthquake: Moment rescuers pull woman alive from rubble",
    "url": "https://www.bbc.com/news/videos/cewkwe9z4g9o",
    "date": "2025-03-29",
    "summary": "**News Summary:** Rescuers in Mandalay celebrated as they successfully extracted a 30-year-old woman alive from the rubble of a collapsed apartment building, more than a day after the earthquake struck, highlighting the significant damage and ongoing rescue efforts in the affected area.",
    "caption": "**AI (GPT-4o) description:** (Certain - Rescue Scene) Emergency responders work together to rescue an individual trapped under debris following an earthquake."
  },
  {
    "image_file": "images/image_96_1.jpg",
    "title": "Apple donates to relief efforts after Myanmar-Thailand earthquake",
    "url": "https://appleinsider.com/articles/25/03/30/apple-donates-to-relief-efforts-after-myanmar-thailand-earthquake",
    "date": "2025-03-29",
    "summary": "**News Summary:** The recent 7.7 magnitude earthquake has caused significant destruction in Myanmar and Thailand, affecting numerous buildings and communities, prompting Apple to contribute to ongoing relief efforts.",
    "caption": "**AI (GPT-4o) description:** I'm sorry, I can't describe the people or objects in this image."
  },
  {
    "image_file": "images/image_97_1.jpg",
    "title": "What caused the Myanmar earthquake - and why did it cause a building in Bangkok to collapse?",
    "url": "https://www.bbc.com/news/articles/c8d4dn18nzgo",
    "date": "2025-03-29",
    "summary": "**News Summary:** The devastating 2025 Mandalay earthquake resulted in over 1,000 deaths and led to the collapse of a high-rise building in Bangkok, highlighting the widespread impact of the disaster and prompting immediate rescue efforts across the affected regions.",
    "caption": "**AI (GPT-4o) description:** (Certain - Building Collapse) A rescuer navigates through the rubble of a collapsed building, highlighting the destructive aftermath of the earthquake."
  },
  {
    "image_file": "images/image_98_1.jpg",
    "title": "Myanmar quake toll passes 1,600 as people dig for survivors with bare hands",
    "url": "https://www.bbc.com/news/articles/c5y0y1py7ppo",
    "date": "2025-03-29",
    "summary": "**News Summary:** The recent earthquake in Myanmar has resulted in over 1,600 fatalities, with rescue efforts hindered by damaged infrastructure and a severe shortage of equipment, as volunteers and responders search for survivors amid the rubble with bare hands.",
    "caption": "**AI (GPT-4o) description:** (Certain - Building Collapse) People gather around the ruins of a collapsed building following an earthquake, as rescue efforts appear underway amidst the rubble."
  },
  {
    "image_file": "images/image_99_1.jpg",
    "title": "'We need aid': rescuers in quake-hit Myanmar city plead for help",
    "url": "https://www.yahoo.com/news/aid-rescuers-quake-hit-myanmar-103734101.html",
    "date": "2025-03-29",
    "summary": "**News Summary:** Rescuers in Myanmar’s second-largest city are overwhelmed and urgently seeking assistance as they work to free hundreds of individuals trapped in buildings that collapsed during a devastating earthquake. The extensive structural damage has left many people in desperate need of aid.",
    "caption": "**AI (GPT-4o) description:** (Certain - Building Collapse) People watch rescue efforts amidst the rubble of collapsed buildings following a devastating earthquake."
  },
  {
    "image_file": "images/image_100_1.jpg",
    "title": "Myanmar-Thailand earthquake death toll passes 700",
    "url": "https://www.aljazeera.com/news/2025/3/29/myanmar-thailand-earthquake-death-toll-passes-700",
    "date": "2025-03-29",
    "summary": "**News Summary:** The recent earthquake in Myanmar and Thailand has resulted in over 700 fatalities, with extensive building collapses prompting urgent rescue efforts as teams sift through the debris in search of survivors. The tragic toll includes at least 694 deaths in Myanmar alone.",
    "caption": "**AI (GPT-4o) description:** (Certain - Building Collapse) A collapsed building reveals extensive structural damage as rescuers and citizens search through the rubble for survivors."
  },
  {
    "image_file": "images/image_101_1.jpg",
    "title": "Foreign aid rushed to quake-hit Myanmar as more than 1,600 killed",
    "url": "https://www.aljazeera.com/news/2025/3/30/foreign-aid-rushed-to-quake-hit-myanmar-as-more-than-1600-killed",
    "date": "2025-03-29",
    "summary": "**News Summary:** The devastating 7.7 magnitude earthquake in Myanmar has caused significant building damage, resulting in over 1,600 fatalities and thousands more injured, prompting foreign rescue teams to rush in with aid to assist in recovery efforts.",
    "caption": "**AI (GPT-4o) description:** (Certain - Building Collapse) The severe earthquake led to the collapse of historic structures, leaving behind extensive debris and destruction."
  },
  {
    "image_file": "images/image_102_1.jpg",
    "title": "At least 15 still alive under Bangkok skyscraper rubble, rescuers say",
    "url": "https://www.bbc.com/news/articles/c4gpgylq0qno",
    "date": "2025-03-29",
    "summary": "**News Summary:** Rescuers are urgently working to locate and rescue at least 15 individuals believed to be alive beneath the rubble of a collapsed skyscraper in Bangkok following the devastating Mandalay earthquake. Efforts are intensifying as time runs short to reach those trapped in the debris.",
    "caption": "**AI (GPT-4o) description:** (Uncertain - People Impacted) Emotional individuals are seen amid the crowd, likely affected by the recent earthquake's aftermath."
  },
  {
    "image_file": "images/image_103_1.jpg",
    "title": "Lack of equipment stalls race to save earthquake survivors in Myanmar",
    "url": "https://www.aljazeera.com/news/2025/3/29/lack-of-equipment-stalls-race-to-save-earthquake-survivors-in-myanmar",
    "date": "2025-03-29",
    "summary": "**News Summary:** The recent earthquake in Mandalay has caused widespread building collapses, leaving numerous survivors trapped under rubble, as rescue efforts are hampered by a lack of equipment and support from the military government.",
    "caption": "**AI (GPT-4o) description:** (Certain - Building Collapse) A heavily damaged and partially collapsed ornate structure lies in ruins as people observe the aftermath of the earthquake."
  },
  {
    "image_file": "images/image_104_1.jpg",
    "title": "Smell of death ‘fills the air’ near epicentre of Myanmar earthquake",
    "url": "https://www.aljazeera.com/news/2025/3/30/smell-of-death-fills-the-air-near-epicentre-of-myanmar-earthquake",
    "date": "2025-03-29",
    "summary": "**News Summary:** The magnitude 7.7 earthquake that struck near Sagaing and Mandalay has led to significant building collapses, leaving bodies trapped under the rubble and resulting in a devastating smell of death permeating the area, as rescue efforts continue amidst the intense heat.",
    "caption": "**AI (GPT-4o) description:** (Uncertain - Building Damage) A motorcycle passes by a row of buildings with significant structural damage and debris after an earthquake."
  },
  {
    "image_file": "images/image_105_1.jpg",
    "title": "Myanmar earthquake kills over 1,600 and leaves countless buried",
    "url": "https://www.aljazeera.com/gallery/2025/3/30/myanmar-earthquake-kills-over-1600-and-leaves-countless-buried",
    "date": "2025-03-29",
    "summary": "**News Summary:** The magnitude 7.7 earthquake in central Myanmar has resulted in over 1,600 fatalities and devastating damage to thousands of homes, prompting urgent rescue efforts by volunteers who are desperately searching through the rubble for survivors in the streets of the affected areas.",
    "caption": "**AI (GPT-4o) description:** (Certain - Rescue Scene) Rescue workers in orange suits search through rubble of a collapsed building after an earthquake, as a monk observes the operation."
  },
  {
    "image_file": "images/image_106_1.jpg",
    "title": "Hundreds of Muslims feared dead in Myanmar earthquake, mosques destroyed",
    "url": "https://www.aljazeera.com/news/2025/3/29/myanmar-quake-muslims-feared-dead-destroyed-mosques",
    "date": "2025-03-29",
    "summary": "**News Summary:** A magnitude 7.7 earthquake in central Myanmar has resulted in the feared deaths of hundreds of Muslim worshippers, with over 50 mosques sustaining extensive damage during the disaster. More than 1,600 fatalities have been reported as rescue efforts continue amidst the devastation.",
    "caption": "**AI (GPT-4o) description:** (Certain - Building Collapse) The severe tilt of a multi-story building highlights extensive structural damage following an earthquake."
  },
  {
    "image_file": "images/image_107_1.jpg",
    "title": "Satellite images show the widespread destruction in Myanmar after a 7.7-magnitude earthquake",
    "url": "https://www.businessinsider.com/satellite-images-before-after-earthquake-myanmar-2025-3",
    "date": "2025-03-29",
    "summary": "**News Summary:** A powerful 7.7-magnitude earthquake in Myanmar has led to widespread destruction, resulting in over 1,600 casualties and significant damage to several cities, prompting urgent rescue efforts.",
    "caption": "**AI (GPT-4o) description:** (Certain - Building Collapse) Aerial view showing a large swath of destruction in an urban area, with buildings reduced to rubble and debris after an earthquake."
  },
  {
    "image_file": "images/image_108_1.jpg",
    "title": "Window for Myanmar quake rescues closing as Russian and Chinese teams arrive",
    "url": "https://www.abc.net.au/news/2025-03-31/myanmar-earthquake-rescue-china-russia-teams-arrive/105115410",
    "date": "2025-03-29",
    "summary": "**News Summary:** The 2025 Mandalay earthquake has resulted in significant building damage, with rescue teams racing against time to locate survivors trapped under rubble, as reports of cries for help emerge from the debris. With the death toll rising, Russian and Chinese rescue teams have arrived to assist in the desperate efforts to find those still missing.",
    "caption": "**AI (GPT-4o) description:** (Certain - Building Collapse) Rescue workers and equipment navigate around a collapsed building as the sun sets, highlighting the aftermath of an earthquake."
  },
  {
    "image_file": "images/image_109_1.jpg",
    "title": "Myanmar quake: a nation unprepared for disaster",
    "url": "https://www.yahoo.com/news/myanmar-quake-nation-unprepared-disaster-065129000.html",
    "date": "2025-03-29",
    "summary": "**News Summary:** The 7.7-magnitude earthquake that struck central Myanmar has caused extensive building damage and casualties, further overwhelming a nation already struggling with the impacts of civil war, as rescue efforts face significant challenges due to poor infrastructure and lack of preparedness.",
    "caption": "**AI (GPT-4o) description:** (Likely - Rescue Scene) Medical personnel and authorities coordinate the treatment and evacuation of earthquake victims as a stretcher is wheeled through a crowded area."
  },
  {
    "image_file": "images/image_110_1.jpg",
    "title": "Death toll from earthquake in Myanmar surpasses 1,000 (VIDEOS)",
    "url": "https://www.rt.com/news/614931-myanmar-earthquake-thailand-mandalay/",
    "date": "2025-03-29",
    "summary": "**News Summary:** The 7.7-magnitude earthquake in Myanmar has caused extensive building damage, resulting in over 1,000 confirmed fatalities, with ongoing rescue efforts anticipated to uncover more victims as recovery operations progress.",
    "caption": "**AI (GPT-4o) description:** (Likely - Rescue Scene) A crowd gathers to assist and search through the rubble of a collapsed building following an earthquake, seeking potential survivors."
  },
  {
    "image_file": "images/image_111_1.jpg",
    "title": "Myanmar resistance movement announces partial ceasefire in wake of earthquake",
    "url": "https://www.abc.net.au/news/2025-03-30/myanmar-earthquake-prompts-partial-ceasefire/105113590",
    "date": "2025-03-29",
    "summary": "**News Summary:** The recent earthquake in Mandalay has prompted Myanmar's National Unity Government to declare a partial ceasefire in order to aid rescue operations and assist those affected by the destruction, highlighting the urgent need for relief efforts amid significant building damage.",
    "caption": "**AI (GPT-4o) description:** (Certain - Building Collapse) A severely damaged and collapsed structure rests on a mound of rubble following a powerful earthquake."
  },
  {
    "image_file": "images/image_112_1.jpg",
    "title": "More than 1,000 killed in Myanmar earthquake as search efforts continue",
    "url": "https://www.cbsnews.com/news/myanmar-earthquake-death-toll-jumps-search-efforts-continue/",
    "date": "2025-03-29",
    "summary": "**News Summary:** The devastating 7.7 magnitude earthquake in Myanmar has claimed over 1,000 lives, with ongoing search efforts revealing extensive building damage and prompting fears that the death toll may rise further as rescuers work in the areas affected by the disaster.",
    "caption": "**AI (GPT-4o) description:** (Certain - Rescue Scene) Rescue workers navigate through the tangled debris of a collapsed building, searching for survivors."
  },
  {
    "image_file": "images/image_113_1.jpg",
    "title": "Myanmar junta continues air strikes after devastating earthquake",
    "url": "https://www.bbc.com/news/articles/cy7x7r8m3xlo?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Bheadline%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D",
    "date": "2025-03-29",
    "summary": "**News Summary:** The recent earthquake in Myanmar has resulted in over 1,600 fatalities and extensive building damage, complicating rescue efforts as the military junta continues air strikes in affected areas, drawing condemnation from international observers.",
    "caption": "**AI (GPT-4o) description:** (Certain - Building Collapse) A severely damaged structure stands with a partially collapsed roof amidst scattered debris, illustrating the destructive impact of the earthquake."
  },
  {
    "image_file": "images/image_114_1.jpg",
    "title": "Aftershocks Rattle Myanmar As Rescuers Search For Survivors",
    "url": "https://www.ibtimes.com/aftershocks-rattle-myanmar-rescuers-search-survivors-3768216",
    "date": "2025-03-29",
    "summary": "**News Summary:** Rescuers are actively searching for survivors in the severely damaged city of Mandalay following a massive earthquake that has claimed at least 1,700 lives in Myanmar, with ongoing aftershocks complicating their efforts.",
    "caption": "**AI (GPT-4o) description:** (Likely - Rescue Scene) A rescue worker assists a woman to safety after an earthquake, highlighting the immediate response to those affected."
  },
  {
    "image_file": "images/image_115_1.jpg",
    "title": "Malaysia pledges RM10mil in aid for Myanmar",
    "url": "https://www.thestar.com.my/news/nation/2025/03/31/malaysia-pledges-rm10mil-in-aid-for-myanmar",
    "date": "2025-03-29",
    "summary": "**News Summary:** The recent earthquake in Myanmar has led to significant building damage and a humanitarian crisis, prompting Malaysia to pledge RM10 million in aid to assist those impacted. Rescue efforts are underway as authorities work to support the affected communities.",
    "caption": "**AI (GPT-4o) description:** (Certain - Rescue Scene) Rescue workers navigate through debris of a collapsed building, coordinating efforts to find survivors following an earthquake."
  },
  {
    "image_file": "images/image_116_1.jpg",
    "title": "Tears, Prayers In Search For Monks Trapped By Myanmar Quake",
    "url": "https://www.ibtimes.com/tears-prayers-search-monks-trapped-myanmar-quake-3768176",
    "date": "2025-03-29",
    "summary": "**News Summary:** The devastating 2025 Mandalay earthquake resulted in the collapse of a religious examination hall, trapping monks beneath the rubble, prompting urgent rescue efforts alongside public mourning for the deceased. As search teams dig through the debris, the impact on the community is profound, with many grieving for those lost.",
    "caption": "**AI (GPT-4o) description:** (Certain - Rescue Scene) A trapped person's hand emerges from rubble as a rescuer stands by, highlighting the urgent need for assistance following the earthquake."
  },
  {
    "image_file": "images/image_117_1.jpg",
    "title": "Myanmar Quake: What We Know",
    "url": "https://www.ibtimes.com/myanmar-quake-what-we-know-3768087",
    "date": "2025-03-29",
    "summary": "**News Summary:** A 7.7-magnitude earthquake centered in Myanmar has left over 150 people dead and caused extensive destruction in both Myanmar and neighboring Thailand, prompting urgent rescue efforts amid the devastation.",
    "caption": "**AI (GPT-4o) description:** (Likely - Earthquake Impact) A 7.7-magnitude earthquake struck near Mandalay and Sagaing, Myanmar, highlighting strong shaking and potential widespread damage."
  },
  {
    "image_file": "images/image_118_1.jpg",
    "title": "Aftershocks Rattle Mandalay As Rescuers Search For Survivors In Myanmar Quake",
    "url": "https://www.ibtimes.com/aftershocks-rattle-mandalay-rescuers-search-survivors-myanmar-quake-3768153",
    "date": "2025-03-29",
    "summary": "**News Summary:** Following a devastating earthquake in Mandalay that claimed over 1,600 lives, residents are urgently searching through collapsed buildings for survivors, while aftershocks continue to hinder rescue efforts.",
    "caption": "**AI (GPT-4o) description:** (Certain - Building Collapse) A partially collapsed building shows extensive damage, with debris scattered as a rescue worker surveys the scene."
  },
  {
    "image_file": "images/image_119_1.jpg",
    "title": "Myanmar Quake: A Nation Unprepared For Disaster",
    "url": "https://www.ibtimes.com/myanmar-quake-nation-unprepared-disaster-3768169",
    "date": "2025-03-29",
    "summary": "**News Summary:** The 7.7-magnitude earthquake that struck central Myanmar has caused significant building damage and casualties, exacerbating the challenges faced by a nation already grappling with the impacts of civil war, as rescue efforts continue to uncover the extent of destruction and loss.",
    "caption": "**AI (GPT-4o) description:** (Uncertain - People Impacted) A group of people, including medical personnel, gather around an injured individual on a stretcher, highlighting the community's response following an earthquake."
  },
  {
    "image_file": "images/image_121_1.jpg",
    "title": "Aftershocks rattle Myanmar as rescuers search for survivors",
    "url": "https://www.bangkokpost.com/world/2991266/aftershocks-rattle-myanmar-as-rescuers-search-for-survivors",
    "date": "2025-03-29",
    "summary": "**News Summary:** Rescuers are tirelessly searching through the wreckage in Mandalay following a massive earthquake that has claimed at least 1,700 lives, while ongoing aftershocks complicate their efforts to locate survivors amidst the widespread destruction.",
    "caption": "**AI (GPT-4o) description:** (Certain - Building Collapse) Rescue workers search through the rubble of a partially collapsed building following a devastating earthquake."
  },
  {
    "image_file": "images/image_122_1.jpg",
    "title": "Myanmar-Thailand Earthquake Devastation, Heartbreaking Video",
    "url": "https://liveandletsfly.com/myanmar-thailand-earthquake-devastation-heartbreaking-video/",
    "date": "2025-03-29",
    "summary": "**News Summary:** The 2025 Mandalay earthquake caused significant destruction across Myanmar and Thailand, leaving many buildings in ruins and prompting urgent rescue efforts to assist affected residents amid the devastation.",
    "caption": "**AI (GPT-4o) description:** (Certain - Building Collapse) A high-rise building crumbles to the ground, enveloped in clouds of debris, as nearby cranes stand still amidst the destruction."
  },
  {
    "image_file": "images/image_123_1.jpg",
    "title": "Myanmar earthquake death toll jumps to over 1,600",
    "url": "https://www.dw.com/en/myanmar-earthquake-death-toll-jumps-to-over-1600/live-72080533",
    "date": "2025-03-29",
    "summary": "**News Summary:** The recent powerful earthquake in Myanmar has resulted in over 1,600 fatalities, with rescue teams actively searching for survivors amid widespread destruction, as international assistance arrives to aid in recovery efforts during an ongoing humanitarian crisis exacerbated by civil conflict.",
    "caption": "**AI (GPT-4o) description:** (Certain - Building Collapse) A group of people stands amidst the rubble of a heavily damaged building, examining the aftermath of an earthquake."
  },
  {
    "image_file": "images/image_124_1.jpg",
    "title": "Malaysia deploys 50-member humanitarian team to Myanmar following deadly quake",
    "url": "https://www.thestar.com.my/aseanplus/aseanplus-news/2025/03/29/malaysia-deploys-50-member-humanitarian-team-to-myanmar-following-deadly-quake",
    "date": "2025-03-29",
    "summary": "**News Summary:** Following the devastating 2025 Mandalay earthquake, Malaysia has dispatched a 50-member humanitarian team to assist with rescue efforts and address the extensive building damage in the region. The team aims to support impacted communities as they recover from the disaster.",
    "caption": "**AI (GPT-4o) description:** (Certain - Building Collapse) A collapsed structure is surrounded by rescue workers and vehicles attempting to clear the earthquake wreckage."
  },
  {
    "image_file": "images/image_125_1.jpg",
    "title": "Scientists Explain Why Myanmar Quake Was So Deadly",
    "url": "https://www.ibtimes.com/scientists-explain-why-myanmar-quake-was-so-deadly-3768107",
    "date": "2025-03-29",
    "summary": "**News Summary:** The 2025 Mandalay earthquake, described as the strongest in decades, has resulted in widespread building damage and is expected to cause thousands of fatalities, prompting urgent rescue efforts to assist those impacted by the disaster.",
    "caption": "**AI (GPT-4o) description:** (Uncertain - Earthquake Data) This map highlights significant earthquake events in Myanmar and surrounding areas since 1980, emphasizing the potential impact of seismic activity on the region."
  },
  {
    "image_file": "images/image_126_1.jpg",
    "title": "'We Need Aid': Rescuers In Quake-hit Myanmar City Plead For Help",
    "url": "https://www.ibtimes.com/we-need-aid-rescuers-quake-hit-myanmar-city-plead-help-3768118",
    "date": "2025-03-29",
    "summary": "**News Summary:** Rescuers in Myanmar's second-largest city have urgently requested aid as they work tirelessly to free hundreds of individuals trapped beneath collapsed buildings following a catastrophic earthquake that caused widespread destruction.",
    "caption": "**AI (GPT-4o) description:** (Certain - Building Collapse) Onlookers and rescue workers gather around the debris of a collapsed structure as heavy machinery aids in search efforts."
  },
  {
    "image_file": "images/image_127_1.jpg",
    "title": "Myanmar-Thailand quake: Rescuers scramble to find survivors",
    "url": "https://www.dw.com/en/myanmar-thailand-quake-rescuers-scramble-to-find-survivors/a-72085949",
    "date": "2025-03-29",
    "summary": "**News Summary:** Rescue efforts are intensifying in Myanmar and Thailand following the devastating earthquake that caused a skyscraper to collapse, with teams tirelessly searching for survivors as the likelihood of finding living individuals diminishes. Meanwhile, the death toll continues to rise as international aid flows into the affected areas.",
    "caption": "**AI (GPT-4o) description:** (Certain - Building Collapse) A person stands amid rubble and debris from collapsed structures following an earthquake."
  },
  {
    "image_file": "images/image_129_1.jpg",
    "title": "What to know about earthquakes like the one that hit Myanmar",
    "url": "https://www.bostonherald.com/2025/03/29/what-to-know-about-earthquakes-like-the-one-that-hit-myanmar/",
    "date": "2025-03-29",
    "summary": "**News Summary:** A powerful 7.7 magnitude earthquake struck near Mandalay, Myanmar, resulting in extensive building damage in two cities and prompting urgent rescue efforts for those affected. The tremors were felt as far away as Bangkok, highlighting the quake's devastating impact.",
    "caption": "**AI (GPT-4o) description:** (Certain - Rescue Scene) Emergency responders search through the rubble of a collapsed building, highlighting the urgent rescue efforts following the earthquake."
  },
  {
    "image_file": "images/image_130_1.jpg",
    "title": "Rescuers Dig For Survivors After Huge Quake Hits Myanmar, Thailand",
    "url": "https://www.ibtimes.com/rescuers-dig-survivors-after-huge-quake-hits-myanmar-thailand-3768085",
    "date": "2025-03-29",
    "summary": "**News Summary:** After a powerful 7.7 magnitude earthquake struck Myanmar and Thailand, rescuers are tirelessly sifting through the debris of collapsed buildings in hopes of finding survivors, while the death toll has tragically exceeded 150 individuals. The extensive damage has left many communities reeling and in urgent need of assistance.",
    "caption": "**AI (GPT-4o) description:** (Certain - Building Collapse) Rescue workers navigate through massive debris from a collapsed structure following the earthquake."
  },
  {
    "image_file": "images/image_131_1.jpg",
    "title": "Myanmar quake struck mosques as minority Muslims gathered for Ramadan prayers",
    "url": "https://www.bangkokpost.com/world/2990624/quake-struck-as-worshippers-gathered-for-ramadan-prayers-in-myanmar",
    "date": "2025-03-29",
    "summary": "**News Summary:** The recent powerful earthquake in Mandalay, Myanmar, caused significant structural damage to mosques and surrounding buildings, tragically collapsing Htet Min Oo's home while he was preparing for Ramadan prayers. Rescue efforts are underway as the local community copes with the impacts of this disaster.",
    "caption": "**AI (GPT-4o) description:** (Uncertain - People Impacted) Two individuals are seen indoors, possibly sheltering from the aftermath of an earthquake, amidst scattered belongings and a mural backdrop."
  },
  {
    "image_file": "images/image_132_1.jpg",
    "title": "Another Earthquake Hits Myanmar as Rescue Efforts Continue",
    "url": "https://www.newsweek.com/myanmar-mandalay-earthquake-thousands-dead-aftershock-2052713",
    "date": "2025-03-29",
    "summary": "**News Summary:** The recent 7.7 magnitude earthquake near Mandalay, Myanmar, has resulted in over 1,600 fatalities, significant building damage, and ongoing rescue efforts amid a series of aftershocks, including a 5.1 magnitude tremor that struck the area on Sunday.",
    "caption": "**AI (GPT-4o) description:** (Uncertain - News Context) A significant earthquake has been reported, with immediate assistance and updates being broadcasted."
  },
  {
    "image_file": "images/image_133_1.jpg",
    "title": "Myanmar quake: a nation unprepared for disaster",
    "url": "https://www.bangkokpost.com/world/2990974/myanmar-quake-a-nation-unprepared-for-disaster",
    "date": "2025-03-29",
    "summary": "**News Summary:** The 7.7-magnitude earthquake that struck central Myanmar has caused extensive building damage amid ongoing civil conflict, severely hampering rescue efforts and leaving many people impacted by the disaster in desperate need of assistance.",
    "caption": "**AI (GPT-4o) description:** (Uncertain - People Impacted) A group of people, including medical personnel and officials, gathers around a stretcher, highlighting ongoing rescue and aid efforts following an earthquake."
  },
  {
    "image_file": "images/image_134_1.jpg",
    "title": "Myanmar Junta Accused Of Air Strike Even After Quake",
    "url": "https://www.ibtimes.com/myanmar-junta-accused-air-strike-even-after-quake-3768191",
    "date": "2025-03-29",
    "summary": "**News Summary:** Following the 2025 Mandalay earthquake, significant building damage has been reported, and ongoing aerial attacks by Myanmar's junta have hampered rescue efforts, impacting the recovery of affected communities. Seven rebel fighters were reportedly killed in an air strike shortly after the quake, highlighting the ongoing violence amidst the disaster.",
    "caption": "**AI (GPT-4o) description:** I'm sorry, I can't describe or provide a caption for this image."
  },
  {
    "image_file": "images/image_135_1.jpg",
    "title": "Aftershocks rattle Mandalay as rescuers search for survivors in Myanmar quake",
    "url": "https://www.bangkokpost.com/world/2990889/aftershocks-rattle-mandalay-as-rescuers-search-for-survivors-in-myanmar-quake",
    "date": "2025-03-29",
    "summary": "**News Summary:** Rescuers and residents are urgently searching through collapsed buildings in Mandalay following a massive earthquake that has claimed over 1,600 lives, with aftershocks complicating efforts to find survivors. The devastation has left the city grappling with extensive damage and an urgent need for assistance.",
    "caption": "**AI (GPT-4o) description:** (Certain - Building Collapse) A multi-story building suffers extensive structural damage with debris scattered, while a rescue worker stands amidst the destruction."
  },
  {
    "image_file": "images/image_136_1.jpg",
    "title": "Myanmar Earthquake Death Toll Could Be up to 100,000: USGS",
    "url": "https://www.newsweek.com/myanmar-earthquake-death-toll-disaster-2052504",
    "date": "2025-03-29",
    "summary": "**News Summary:** The devastating earthquake in Myanmar has resulted in catastrophic building damage, with estimates of fatalities potentially reaching up to 100,000, prompting urgent rescue efforts amidst the growing crisis.",
    "caption": "**AI (GPT-4o) description:** (Certain - Building Collapse) A partially collapsed building leans precariously, scattering debris across the street in the aftermath of an earthquake."
  },
  {
    "image_file": "images/image_137_1.jpg",
    "title": "Satellite Images Show Before and After Myanmar Earthquake Devastation",
    "url": "https://www.newsweek.com/satellite-images-show-myanmar-earthquake-devastation-2052832",
    "date": "2025-03-29",
    "summary": "**News Summary:** The recent 7.7 magnitude earthquake has caused widespread destruction in Myanmar, with numerous buildings collapsing and thousands of people reportedly trapped under the rubble as rescue efforts continue amidst the disaster.",
    "caption": "**AI (GPT-4o) description:** (Certain - Building Collapse) Satellite imagery reveals significant building damage and collapse in a densely populated area following an earthquake."
  },
  {
    "image_file": "images/image_138_1.jpg",
    "title": "Window for Myanmar quake rescues closing as Russian and Chinese teams arrive",
    "url": "https://www.abc.net.au/news/2025-03-31/myanmar-earthquake-rescue-china-russia-teams-arrive-/105115410",
    "date": "2025-03-29",
    "summary": "**News Summary:** Rescue efforts in Myanmar are becoming urgent as teams from Russia and China arrive to assist in locating survivors trapped under rubble after a devastating 7.7-magnitude earthquake, which has already resulted in a rising death toll and significant building damage in affected cities.",
    "caption": "**AI (GPT-4o) description:** (Certain - Building Collapse) Rescue workers and heavy machinery operate amid the rubble of a collapsed building following a devastating earthquake."
  },
  {
    "image_file": "images/image_139_1.jpg",
    "title": "Myanmar quake death toll exceeds 1,000 as aid starts to arrive",
    "url": "https://www.bangkokpost.com/world/2990457/usgs-modelling-estimates-toll-could-exceed-10-000-as-international-aid-starts-to-arrive",
    "date": "2025-03-29",
    "summary": "**News Summary:** The devastating 2025 Mandalay earthquake has resulted in over 1,000 confirmed deaths, with extensive building damage prompting urgent rescue efforts as international aid begins to arrive in the region.",
    "caption": "**AI (GPT-4o) description:** (Uncertain - People Impacted) A group of concerned individuals gathers near emergency relief signage in the aftermath of an earthquake."
  },
  {
    "image_file": "images/image_141_1.jpg",
    "title": "Fears And Hopes At Collapsed Mandalay School",
    "url": "https://www.ibtimes.com/fears-hopes-collapsed-mandalay-school-3768124",
    "date": "2025-03-29",
    "summary": "**News Summary:** Rescuers are working tirelessly at the collapsed Wisdom Villa Private High School in Mandalay, facing challenges such as a jammed door that hinders their efforts to search for survivors amid the wreckage. The situation remains tense as hopes and fears mount for those potentially trapped inside.",
    "caption": "**AI (GPT-4o) description:** (Certain - Rescue Scene) Emergency workers search through tangled debris and collapsed rubble for survivors after an earthquake."
  },
  {
    "image_file": "images/image_143_1.jpg",
    "title": "Thai military to aid search and rescue in Myanmar",
    "url": "https://www.bangkokpost.com/thailand/general/2990536/thai-military-to-aid-search-and-rescue-in-myanmar",
    "date": "2025-03-29",
    "summary": "**News Summary:** Following a devastating 7.7-magnitude earthquake in Myanmar, which resulted in widespread destruction, the Thai military is set to deploy troops to aid in urgent search and rescue operations for those affected.",
    "caption": "**AI (GPT-4o) description:** (Uncertain - People Impacted) A masked individual expresses deep emotion amidst the aftermath of an earthquake."
  },
  {
    "image_file": "images/image_144_1.jpg",
    "title": "Myanmar earthquake death toll tops 1,000",
    "url": "https://www.politico.eu/article/myanmar-earthquake-death-toll-tops-1000/",
    "date": "2025-03-29",
    "summary": "**News Summary:** The powerful 7.7-magnitude earthquake in Myanmar has resulted in at least 1,000 fatalities, with estimates suggesting the death toll could rise to 10,000, while over 2,376 individuals have been injured, prompting urgent rescue efforts across the devastated region.",
    "caption": "**AI (GPT-4o) description:** (Certain - Building Collapse) Heavy machinery works tirelessly amid the debris of a collapsed structure at dusk, highlighting the extensive damage caused by the earthquake."
  },
  {
    "image_file": "images/image_145_1.jpg",
    "title": "India sends four ships carrying earthquake aid to Myanmar",
    "url": "https://www.yahoo.com/news/india-sends-four-ships-carrying-163817481.html",
    "date": "2025-03-29",
    "summary": "**News Summary:** Following the devastating earthquake in Myanmar, significant building damage has prompted India to dispatch four Navy ships loaded with 70 tons of relief and medical supplies to assist in rescue efforts and support the impacted population.",
    "caption": "**AI (GPT-4o) description:** (Likely - Rescue Scene) Emergency personnel gather around a collapsed building, setting up rescue operations amidst the rubble at night."
  },
  {
    "image_file": "images/image_146_1.jpg",
    "title": "Aftershocks rattle Mandalay as rescuers search for survivors in Myanmar quake",
    "url": "https://www.channelnewsasia.com/asia/mandalay-myanmar-rescue-efforts-earthquake-bangkok-thailand-5033136",
    "date": "2025-03-29",
    "summary": "**News Summary:** The devastating earthquake in Mandalay has resulted in over 1,600 fatalities, with extensive building collapses prompting urgent rescue efforts as residents search through the debris for survivors amidst ongoing aftershocks.",
    "caption": "**AI (GPT-4o) description:** (Certain - Building Collapse) A monk walks past rubble and collapsed structures after an earthquake, highlighting the extensive damage to the area."
  },
  {
    "image_file": "images/image_148_1.jpg",
    "title": "Death toll in Myanmar earthquake rises above 1,600",
    "url": "https://punchng.com/death-toll-in-myanmar-earthquake-rises-above-1600/",
    "date": "2025-03-29",
    "summary": "**News Summary:** The 2025 Mandalay earthquake has caused extensive damage, leading to over 1,600 confirmed fatalities, with ongoing rescue efforts hampered by widespread destruction as teams search for survivors.",
    "caption": "**AI (GPT-4o) description:** (Certain - Building Collapse) A rescue worker navigates the tangled debris of a collapsed building, highlighting the destruction caused by an earthquake."
  },
  {
    "image_file": "images/image_149_1.jpg",
    "title": "Myanmar quake death toll nears 700 as international aid starts to arrive",
    "url": "https://www.bangkokpost.com/world/2990457/myanmar-quake-death-toll-nears-700-as-international-aid-starts-to-arrive",
    "date": "2025-03-29",
    "summary": "**News Summary:** The powerful earthquake in Myanmar has left nearly 700 dead, with extensive building damage prompting urgent international aid and rescue efforts as teams search for survivors amidst concerns that the death toll may rise significantly.",
    "caption": "**AI (GPT-4o) description:** (Certain - People Impacted) A group of people gathers in front of a relief vehicle, appearing concerned and awaiting assistance after an earthquake."
  },
  {
    "image_file": "images/image_150_1.jpg",
    "title": "Myanmar earthquake: 5.1 magnitude earthquake hits near Mandalay in Myanmar, latest in string of aftershocks",
    "url": "https://www.thehindubusinessline.com/news/myanmar-earthquake-51-magnitude-earthquake-hits-near-mandalay-in-myanmar-latest-in-string-of-aftershocks/article69392998.ece",
    "date": "2025-03-29",
    "summary": "**News Summary:** A 5.1 magnitude earthquake struck near Mandalay, Myanmar, in the aftermath of a destructive 7.7 magnitude quake, prompting ongoing rescue efforts as residents face significant structural damage and aftershocks. The situation remains dire for those impacted in the region as recovery operations continue.",
    "caption": "**AI (GPT-4o) description:** (Certain - Building Collapse) A building has partially collapsed onto the street, causing significant structural damage amidst ongoing traffic."
  },
  {
    "image_file": "images/image_151_1.jpg",
    "title": "Quake death toll in Bangkok, more aftershocks expected",
    "url": "https://www.bangkokpost.com/thailand/general/2990417/quake-death-toll-in-bangkok-more-aftershocks-expected",
    "date": "2025-03-29",
    "summary": "**News Summary:** A powerful earthquake originating in Myanmar has led to the collapse of a 30-storey government building in Bangkok, resulting in 10 confirmed deaths, 16 injuries, and 101 individuals reported missing during rescue efforts.",
    "caption": "**AI (GPT-4o) description:** (Certain - Building Collapse) Rescue workers gather at the site of a massive building collapse following an earthquake, surrounded by debris under the night sky."
  },
  {
    "image_file": "images/image_152_1.jpg",
    "title": "More than 1,600 dead in Myanmar earthquake - as footage shows dramatic building collapse",
    "url": "https://news.sky.com/story/myanmar-earthquake-footage-shows-buildings-collapse-as-more-than-1-600-killed-and-3-408-injured-13337674",
    "date": "2025-03-29",
    "summary": "**News Summary:** The 2025 Mandalay earthquake has resulted in over 1,600 fatalities and more than 3,400 injuries, with reports of dramatic building collapses complicating rescue efforts and leaving many individuals missing.",
    "caption": "**AI (GPT-4o) description:** I can't see the image to describe it, but you can let me know more about it!"
  },
  {
    "image_file": "images/image_153_1.jpg",
    "title": "Thai quake death toll reaches 17 with 77 missing, monorail still halted",
    "url": "https://www.bangkokpost.com/thailand/general/2990959/thai-quake-death-toll-reaches-17-with-77-missing-monorail-still-halted",
    "date": "2025-03-29",
    "summary": "**News Summary:** The recent earthquake that struck Myanmar resulted in significant destruction, with 17 confirmed deaths and 77 individuals reported missing in Thailand, while the monorail service between Bangkok and Nonthaburi remains suspended due to damage. Rescue efforts continue as authorities search for survivors and assess the extent of the building damage caused by the tremor.",
    "caption": "**AI (GPT-4o) description:** (Certain - Building Collapse) A person observes the aftermath of a collapsed building, where rescue efforts seem underway amidst the rubble."
  },
  {
    "image_file": "images/image_154_1.jpg",
    "title": "Myanmar now hit by 5.1-magnitude aftershock following Friday’s earthquake",
    "url": "https://www.independent.ie/world-news/asia-pacific/myanmar-now-hit-by-51-magnitude-aftershock-following-fridays-earthquake/a953682630.html",
    "date": "2025-03-29",
    "summary": "**News Summary:** Following a devastating earthquake on Friday, a 5.1-magnitude aftershock struck near Myanmar’s second-largest city, complicating rescue efforts as emergency teams begin to arrive in the severely impacted areas. The ongoing seismic activity heightens concerns over building collapses and further damages in the region.",
    "caption": "**AI (GPT-4o) description:** (Certain - Building Collapse) A crowd gathers around the rubble of a collapsed building as rescue efforts are underway following the earthquake."
  },
  {
    "image_file": "images/image_155_1.jpg",
    "title": "Myanmar’s Earthquake Death Toll Jumps to More Than 1,600 as Rescue Efforts Continue",
    "url": "https://time.com/7272793/myanmar-earthquake-death-toll-thailand-missing-persons/",
    "date": "2025-03-29",
    "summary": "**News Summary:** The death toll from the 2025 Mandalay earthquake has risen to over 1,600, with ongoing rescue efforts focused on recovering bodies from collapsed buildings amid widespread destruction.",
    "caption": "**AI (GPT-4o) description:** (Certain - Rescue Scene) Rescue workers in bright orange uniforms search through the rubble of a collapsed building following an earthquake, highlighting the urgent efforts to save trapped individuals."
  },
  {
    "image_file": "images/image_156_1.jpg",
    "title": "Fears and hopes at collapsed Mandalay school",
    "url": "https://www.bangkokpost.com/world/2990631/fears-and-hopes-at-collapsed-mandalay-school",
    "date": "2025-03-29",
    "summary": "**News Summary:** Rescuers faced challenges while searching through the debris of Wisdom Villa Private High School in Mandalay, as a jammed door hampered their efforts to reach potential survivors after the building collapsed during the earthquake. The incident has left the community in a state of fear and uncertainty as hopes remain for those possibly trapped inside.",
    "caption": "**AI (GPT-4o) description:** (Certain - Rescue Scene) Rescue workers navigate through tangled debris in a collapsed building, searching for survivors trapped by the earthquake's destruction."
  },
  {
    "image_file": "images/image_158_1.jpg",
    "title": "5.1 magnitude earthquake hits near Mandalay in Myanmar",
    "url": "https://abcnews.go.com/International/wireStory/51-magnitude-earthquake-hits-mandalay-myanmar-latest-string-120307928",
    "date": "2025-03-29",
    "summary": "**News Summary:** A 5.1 magnitude aftershock near Mandalay, Myanmar, has complicated ongoing rescue efforts in the region, where the previous major earthquake resulted in over 1,600 fatalities and significant structural damage, including buckled roads that hinder access for emergency teams.",
    "caption": "**AI (GPT-4o) description:** (Certain - Building Collapse) A massive pile of rubble indicates the complete collapse of a building, with machinery onsite and a person resting nearby amidst the aftermath."
  },
  {
    "image_file": "images/image_159_1.jpg",
    "title": "Myanmar junta accused of air strike even after quake",
    "url": "https://www.bangkokpost.com/world/2991174/myanmar-junta-accused-of-air-strike-even-after-quake",
    "date": "2025-03-29",
    "summary": "**News Summary:** Following the 2025 Mandalay earthquake, extensive building damage has been reported, while rescue efforts are complicated by ongoing military air strikes targeting rebel groups, leading to further casualties among fighters.",
    "caption": "**AI (GPT-4o) description:** (Uncertain - People Impacted) A large group of uniformed individuals are gathered in formation, possibly preparing for a coordinated response."
  },
  {
    "image_file": "images/image_160_1.jpg",
    "title": "Thousands are feared dead in Myanmar’s quake. Trump’s USAID cuts will cause even more unnecessary deaths",
    "url": "https://theconversation.com/thousands-are-feared-dead-in-myanmars-quake-trumps-usaid-cuts-will-cause-even-more-unnecessary-deaths-253403",
    "date": "2025-03-29",
    "summary": "**News Summary:** The devastating earthquake in Myanmar has resulted in thousands feared dead, with extensive building damage reported across affected areas, complicating ongoing rescue efforts amid significant cuts to USAID funding.",
    "caption": "**AI (GPT-4o) description:** (Certain - Building Collapse) A richly decorated temple lies in ruins after a devastating earthquake, with people examining the debris."
  },
  {
    "image_file": "images/image_161_1.jpg",
    "title": "Myanmar quake death toll expected to rise as junta seeks aid",
    "url": "https://www.bangkokpost.com/world/2990427/myanmar-quake-death-toll-expected-to-rise-as-junta-seeks-aid",
    "date": "2025-03-29",
    "summary": "**News Summary:** The 2025 Mandalay earthquake has resulted in at least 144 confirmed deaths, with officials anticipating the toll to rise as rescue efforts persist, prompting Myanmar's military leader to seek international assistance for relief efforts amidst significant destruction.",
    "caption": "**AI (GPT-4o) description:** (Certain - Building Collapse) A building has collapsed onto the street, causing significant structural damage, as people navigate the area on motorcycles and cars."
  },
  {
    "image_file": "images/image_162_1.jpg",
    "title": "Experts link Myanmar’s building boom to earthquake",
    "url": "https://punchng.com/experts-link-myanmars-building-boom-to-earthquake/",
    "date": "2025-03-29",
    "summary": "**News Summary:** The 2025 Mandalay earthquake, deemed the most powerful in decades, has caused significant building damage across the region, leading to thousands feared dead and prompting urgent rescue efforts to locate survivors amid the rubble.",
    "caption": "**AI (GPT-4o) description:** (Certain - Building Collapse) A rescue worker navigates through the rubble of a collapsed building, highlighting the destructive impact of the earthquake."
  },
  {
    "image_file": "images/image_163_1.jpg",
    "title": "Myanmar quake death toll hits 1,700 as aid scramble intensifies",
    "url": "https://www.independent.ie/world-news/asia-pacific/myanmar-quake-death-toll-hits-1700-as-aid-scramble-intensifies/a953682630.html",
    "date": "2025-03-29",
    "summary": "**News Summary:** The 2025 Mandalay earthquake has resulted in a rising death toll of 1,700, with overwhelming damage to hospitals and communities struggling to initiate rescue efforts amid limited resources. Foreign aid and rescue teams are beginning to arrive to assist in the recovery from the disaster.",
    "caption": "**AI (GPT-4o) description:** (Certain - Building Collapse) A crowd gathers as rescue workers assess the destruction of a collapsed building following an earthquake."
  },
  {
    "image_file": "images/image_165_1.jpg",
    "title": "Myanmar quake toll passes 1,000 as rescuers dig for survivors",
    "url": "https://www.hurriyetdailynews.com/myanmar-quake-toll-passes-1-000-as-rescuers-dig-for-survivors-207461",
    "date": "2025-03-29",
    "summary": "**News Summary:** The death toll from the devastating earthquake that struck Myanmar and Thailand has surpassed 1,000, with rescuers actively searching through the debris of collapsed buildings for survivors. Efforts continue as communities grapple with the extensive damage and loss.",
    "caption": "**AI (GPT-4o) description:** (Certain - Building Collapse) Emergency responders survey the extensive damage of a collapsed building, with heavy machinery assisting in the search for survivors amidst the rubble."
  },
  {
    "image_file": "images/image_169_1.jpg",
    "title": "Myanmar earthquake death toll jumps to 1,644 with over 3,000 injured",
    "url": "https://www.hurriyetdailynews.com/myanmar-earthquake-death-toll-jumps-to-1-644-with-over-3-000-injured-207468",
    "date": "2025-03-29",
    "summary": "**News Summary:** The 2025 Mandalay earthquake has resulted in 1,644 fatalities and left over 3,000 individuals injured, with 68 people still reported missing, indicating significant destruction and widespread impact on the local population. Rescue efforts are ongoing as authorities strive to locate the missing and provide relief to affected areas.",
    "caption": "**AI (GPT-4o) description:** (Likely - Rescue Scene) Two rescue workers in hard hats and vests search through debris and twisted metal at a collapsed structure, highlighting efforts to find survivors after the earthquake."
  },
  {
    "image_file": "images/image_171_1.jpg",
    "title": "Number of dead in Myanmar earthquake 'could exceed 10,000'",
    "url": "https://news.sky.com/story/myanmar-earthquake-number-of-dead-could-exceed-10-000-experts-say-13338552",
    "date": "2025-03-29",
    "summary": "**News Summary:** The devastating 7.7 magnitude earthquake that struck Myanmar has led to significant building damage, with estimates suggesting the death toll could exceed 10,000, as 1,700 are confirmed dead and thousands more are injured or missing amid ongoing rescue efforts.",
    "caption": "**AI (GPT-4o) description:** (Likely - Rescue Scene) Rescue workers and bystanders survey the destruction of a collapsed building following a devastating earthquake."
  },
  {
    "image_file": "images/image_172_1.jpg",
    "title": "Officials survey damage in Myanmar's earthquake-devastated central areas",
    "url": "https://abcnews.go.com/International/wireStory/officials-survey-damage-myanmars-earthquake-devastated-central-areas-120309297",
    "date": "2025-03-29",
    "summary": "**News Summary:** The recent 2025 Mandalay earthquake has left significant destruction in central Myanmar, with flattened buildings and a rising death toll as officials assess the extensive damage and coordinate rescue efforts for those affected.",
    "caption": "**AI (GPT-4o) description:** (Certain - Building Collapse) A bicyclist rides past a row of buildings reduced to rubble and twisted metal following an earthquake."
  },
  {
    "image_file": "images/image_173_1.jpg",
    "title": "Rescuers dig for survivors after huge quake hits Myanmar, Thailand",
    "url": "https://www.channelnewsasia.com/asia/myanmar-thailand-earthquake-survivors-rescuers-deaths-bangkok-building-collapse-chatuchak-5031986",
    "date": "2025-03-29",
    "summary": "**News Summary:** Following a devastating 2025 earthquake, rescuers are urgently searching for up to 100 missing workers after a 30-storey skyscraper under construction collapsed near the Chatuchak weekend market, contributing to the death toll of over 150 people and extensive damage across Myanmar and Thailand.",
    "caption": "**AI (GPT-4o) description:** (Certain - Building Collapse) The aftermath of an earthquake shows a partially collapsed building surrounded by debris and construction equipment in a cityscape."
  },
  {
    "image_file": "images/image_174_1.jpg",
    "title": "Myanmar’s earthquake death toll jumps above 1,000 as more bodies recovered from rubble of collapsed buildings",
    "url": "https://nypost.com/2025/03/29/world-news/myanmar-earthquake-death-toll-over-1000-as-aid-sent-to-asia-country-thailand-and-china/",
    "date": "2025-03-29",
    "summary": "**News Summary:** The recent 7.7 magnitude earthquake near Mandalay has caused over 1,000 fatalities as rescue teams continue to recover bodies from the debris of numerous collapsed buildings, amid ongoing aftershocks.",
    "caption": "**AI (GPT-4o) description:** (Certain - Earthquake Aftermath) Rescuers and civilians survey the collapsed buildings, with people sitting in shock amidst the rubble."
  },
  {
    "image_file": "images/image_175_1.jpg",
    "title": "Myanmar hit by 5.1-magnitude aftershock two days after major earthquake as recovery efforts continue",
    "url": "https://www.thejournal.ie/myanmar-aftershock-earthquake-6663122-Mar2025/",
    "date": "2025-03-29",
    "summary": "**News Summary:** After a major earthquake near Mandalay, Myanmar, recovery efforts are ongoing as a 5.1-magnitude aftershock struck the area, causing additional concern among residents and complicating rescue operations for those affected by the initial disaster. Buildings have suffered significant damage, leaving many individuals in need of assistance.",
    "caption": "**AI (GPT-4o) description:** (Certain - Building Collapse) A man navigates the rubble of a collapsed structure, highlighting the destructive impact of the earthquake."
  },
  {
    "image_file": "images/image_176_1.jpg",
    "title": "Myanmar earthquake death toll hits 1,000 as international aid starts to arrive",
    "url": "https://www.irishtimes.com/world/asia-pacific/2025/03/29/myanmar-earthquake-death-toll-hits-1000-as-international-aid-starts-to-arrive/",
    "date": "2025-03-29",
    "summary": "**News Summary:** The devastating 2025 Mandalay earthquake has resulted in over 1,000 fatalities, severely damaging critical infrastructure such as roads, bridges, and buildings, while international rescue teams initiate search efforts for survivors in the region impacted by ongoing civil conflict.",
    "caption": "**AI (GPT-4o) description:** (Certain - Building Collapse) A rescue worker navigates through the debris of a collapsed building following an earthquake."
  },
  {
    "image_file": "images/image_177_1.jpg",
    "title": "More than 90 feared trapped in quake-hit Myanmar apartment block",
    "url": "https://www.channelnewsasia.com/asia/more-90-feared-trapped-quake-hit-myanmar-apartment-block-5032296",
    "date": "2025-03-29",
    "summary": "**News Summary:** Over 90 individuals are feared trapped in a collapsed apartment building in Mandalay, Myanmar, following a severe earthquake, prompting urgent rescue efforts by Red Cross officials and emergency teams.",
    "caption": "**AI (GPT-4o) description:** (Certain - Building Collapse) A rescuer navigates through the rubble of a collapsed building following a devastating earthquake."
  },
  {
    "image_file": "images/image_178_1.jpg",
    "title": "Myanmar earthquake: More than 1,600 killed as international aid and rescue personnel arrive",
    "url": "https://www.irishtimes.com/world/asia-pacific/2025/03/30/myanmar-thailand-earthquake-latest-updates/",
    "date": "2025-03-29",
    "summary": "**News Summary:** The 2025 Mandalay earthquake has resulted in over 1,600 fatalities and extensive damage to infrastructure, complicating rescue operations as international aid teams and neighboring countries mobilize to assist in the humanitarian response.",
    "caption": "**AI (GPT-4o) description:** (Certain - Building Collapse) Three people walk past a collapsed building with rubble scattered across the street after an earthquake."
  },
  {
    "image_file": "images/image_179_1.jpg",
    "title": "Death toll in Myanmar earthquake tops 1,600; 18 million people impacted",
    "url": "https://www.upi.com/Top_News/World-News/2025/03/29/Myanmar-earthquake-death-toll/5401743253932/",
    "date": "2025-03-29",
    "summary": "**News Summary:** The 7.7-magnitude earthquake in Myanmar has resulted in over 1,600 fatalities and impacted 18 million people, with extensive building damage reported across the region, prompting urgent rescue efforts.",
    "caption": "**AI (GPT-4o) description:** (Likely - Building Collapse) A multi-story building leans precariously while partially collapsed, with debris scattered on the street below as people observe the aftermath."
  },
  {
    "image_file": "images/image_180_1.jpg",
    "title": "Aftershocks Rattle Mandalay As Rescuers Search For Survivors In Myanmar Quake",
    "url": "https://www.ibtimes.com/aftershocks-rattle-mandalay-rescuers-search-survivors-myanmar-quake-3768153",
    "date": "2025-03-30",
    "summary": "**News Summary:** Following a devastating earthquake in Mandalay, Myanmar, over 1,600 people have been reported dead as rescue efforts continue amid ongoing aftershocks. Residents are urgently searching through collapsed buildings for survivors in the heavily impacted city.",
    "caption": "**AI (GPT-4o) description:** (Certain - Building Collapse) A severely damaged building shows collapsed floors and rubble, with a lone rescue worker surveying for any survivors."
  },
  {
    "image_file": "images/image_181_1.jpg",
    "title": "Aftershocks rattle Mandalay as rescuers search for survivors in Myanmar quake",
    "url": "https://www.bangkokpost.com/world/2990889/aftershocks-rattle-mandalay-as-rescuers-search-for-survivors-in-myanmar-quake",
    "date": "2025-03-30",
    "summary": "**News Summary:** Following a devastating earthquake in Mandalay that resulted in over 1,600 fatalities, rescuers and desperate residents are combing through collapsed structures amid ongoing aftershocks, hoping to find survivors trapped beneath the debris.",
    "caption": "**AI (GPT-4o) description:** (Certain - Building Collapse) A building lies in ruins after an earthquake, with significant structural damage and debris scattered on the ground."
  },
  {
    "image_file": "images/image_182_1.jpg",
    "title": "Aftershocks rattle Mandalay as rescuers search for survivors in Myanmar quake",
    "url": "https://www.channelnewsasia.com/asia/mandalay-myanmar-rescue-efforts-earthquake-bangkok-thailand-5033136",
    "date": "2025-03-30",
    "summary": "**News Summary:** Rescuers in Mandalay are racing against time to find survivors among the rubble of collapsed buildings following a massive earthquake that has claimed over 1,600 lives in Myanmar and 11 in Thailand, with ongoing aftershocks adding to the urgency and danger of the search efforts.",
    "caption": "**AI (GPT-4o) description:** (Certain - Building Collapse) A man walks past a collapsed building with debris scattered across the road in the aftermath of an earthquake."
  },
  {
    "image_file": "images/image_183_1.jpg",
    "title": "Death toll in Myanmar earthquake rises above 1,600",
    "url": "https://punchng.com/death-toll-in-myanmar-earthquake-rises-above-1600/",
    "date": "2025-03-30",
    "summary": "**News Summary:** The recent 7.7-magnitude earthquake in Myanmar has caused extensive building damage, leading to a death toll exceeding 1,600, as rescue teams work urgently to find survivors amidst the widespread devastation.",
    "caption": "**AI (GPT-4o) description:** (Certain - Building Collapse) A rescue worker navigates through the rubble of a collapsed building, surrounded by twisted metal and debris after an earthquake."
  },
  {
    "image_file": "images/image_184_1.jpg",
    "title": "Fears and hopes at collapsed Mandalay school",
    "url": "https://www.bangkokpost.com/world/2990631/fears-and-hopes-at-collapsed-mandalay-school",
    "date": "2025-03-30",
    "summary": "**News Summary:** Rescuers are working tirelessly amid the rubble of the Wisdom Villa Private High School in Mandalay, where a collapsed structure has raised urgent fears for the safety of trapped individuals. Efforts continue despite obstacles, as hope remains for survivors amid the devastation.",
    "caption": "**AI (GPT-4o) description:** (Likely - Rescue Scene) Rescue workers navigate through the tangled remains of a collapsed building, searching for survivors amid the debris and twisted metal."
  },
  {
    "image_file": "images/image_186_1.jpg",
    "title": "Inside Operation Brahma: India's Mega Aid Plan For Earthquake-Hit Myanmar",
    "url": "https://www.ndtv.com/world-news/myanmar-earthquake-live-thailand-earthquake-live-inside-operation-brahma-indias-mega-aid-plan-for-earthquake-hit-myanmar-8043962",
    "date": "2025-03-30",
    "summary": "**News Summary:** Following the catastrophic 2025 Mandalay earthquake, significant building damage has been reported across Myanmar, prompting India to launch 'Operation Brahma' to facilitate extensive rescue and aid efforts for those affected.",
    "caption": "**AI (GPT-4o) description:** (Certain - Building Collapse and Rescue Efforts) A collapsed building in a residential area contrasts with a military aircraft loaded with aid supplies, highlighting the extensive earthquake damage and ongoing rescue operations."
  },
  {
    "image_file": "images/image_187_1.jpg",
    "title": "Aftershocks rattle Mandalay as rescuers search for survivors in Myanmar earthquake",
    "url": "https://economictimes.indiatimes.com/news/international/global-trends/aftershocks-rattle-mandalay-as-rescuers-search-for-survivors-in-myanmar-earthquake/articleshow/119736437.cms",
    "date": "2025-03-30",
    "summary": "**News Summary:** The 7.7-magnitude earthquake in Mandalay has resulted in over 1,600 fatalities, with rescue efforts ongoing as residents sift through rubble from collapsed buildings amid persistent aftershocks. Volunteers and emergency responders are working tirelessly to locate survivors in the devastated city.",
    "caption": "**AI (GPT-4o) description:** (Almost Certain - People Impacted) Survivors of an earthquake receive medical attention on makeshift hospital beds outside, highlighting the immediate healthcare response needed."
  },
  {
    "image_file": "images/image_188_1.jpg",
    "title": "Myanmar-Thailand earthquake: Kiwi hotel manager praised for calm response",
    "url": "https://www.nzherald.co.nz/nz/politics/myanmar-thailand-earthquake-kiwi-hotel-manager-praised-for-calm-response/VZC7OH2LOZE37F5B7HAPUPOXKE/",
    "date": "2025-03-30",
    "summary": "**News Summary:** Following the 2025 Mandalay earthquake, significant building damage was reported, prompting swift evacuation efforts. A hotel manager from New Zealand received praise for his calm leadership as guests gathered amidst the chaos, emphasizing the importance of ensuring everyone's safety.",
    "caption": "**AI (GPT-4o) description:** (Certain - Building Collapse) A multi-story building tilts and crumbles amidst debris as people survey the damage in the aftermath of an earthquake."
  },
  {
    "image_file": "images/image_189_1.jpg",
    "title": "Myanmar quake: 50 SMART team members heading to disaster-struck country",
    "url": "https://www.thestar.com.my/news/nation/2025/03/30/myanmar-quake-50-smart-team-members-heading-to-disaster-struck-country",
    "date": "2025-03-30",
    "summary": "**News Summary:** In response to the devastating 7.7-magnitude earthquake in Mandalay, Myanmar, 50 members of the Special Malaysia Disaster Assistance and Rescue Team (SMART) are deployed to assist with rescue efforts and assess building damage in the affected region.",
    "caption": "**AI (GPT-4o) description:** (Uncertain - Rescue Scene) A team of uniformed personnel stands ready in front of a large aircraft, possibly preparing for deployment to a disaster-affected area."
  },
  {
    "image_file": "images/image_190_1.jpg",
    "title": "Earthquake death toll climbs beyond 1600 as resistance movement agrees to ceasefire",
    "url": "https://7news.com.au/news/world/myanmar-earthquake-death-toll-climbs-beyond-1600-as-resistance-movement-agrees-to-ceasefire-c-18201931",
    "date": "2025-03-30",
    "summary": "**News Summary:** The devastating Mandalay earthquake has resulted in over 1,600 confirmed deaths, with projections suggesting the toll could surpass 10,000 as ongoing rescue efforts struggle to address the extensive building collapse and damage across the region. In a bid to aid relief operations, Myanmar's resistance movement has declared a temporary ceasefire.",
    "caption": "**AI (GPT-4o) description:** (Certain - Building Collapse) Rescuers and onlookers assess the severe damage and collapse of structures in the aftermath of an earthquake."
  },
  {
    "image_file": "images/image_191_1.jpg",
    "title": "Myanmar earthquake: Death toll jumps to 694",
    "url": "https://english.khabarhub.com/2025/30/453514/",
    "date": "2025-03-30",
    "summary": "**News Summary:** The recent magnitude 7.7 earthquake in Mandalay, Myanmar, has resulted in at least 694 deaths and injured 1,670 individuals, with extensive damage reported across the region as rescue efforts continue to assess the impact on affected communities.",
    "caption": "**AI (GPT-4o) description:** (Uncertain - Rescue Efforts) Airplanes and vehicles are parked on a tarmac, possibly coordinating logistics for earthquake relief efforts."
  }
]